[["0",{"pageContent":"Unix (; trademarked as UNIX) is a family of multitasking, multiuser computer operating systems that derive from the original AT&T Unix, whose development started in 1969 at the Bell Labs research center by Ken Thompson, Dennis Ritchie, and others.Initially intended for use inside the Bell System, AT&T licensed Unix to outside parties in the late 1970s, leading to a variety of both academic and commercial Unix variants from vendors including University of California, Berkeley (BSD), Microsoft (Xenix), Sun Microsystems (SunOS/Solaris), HP/HPE (HP-UX), and IBM (AIX). In the early 1990s, AT&T sold its rights in Unix to Novell, which then sold the UNIX trademark to The Open Group, an industry consortium founded in 1996. The Open Group allows the use of the mark for certified operating systems that comply with the Single UNIX Specification (SUS).\nUnix systems are characterized by a modular design that is sometimes called the \"Unix philosophy\". According to this philosophy, the operating system should provide a set of simple tools, each of which performs a limited, well-defined function. A unified and inode-based filesystem (the Unix filesystem) and an inter-process communication mechanism","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["1",{"pageContent":"known as \"pipes\" serve as the main means of communication, and a shell scripting and command language (the Unix shell) is used to combine the tools to perform complex workflows.\nUnix distinguishes itself from its predecessors as the first portable operating system: almost the entire operating system is written in the C programming language, which allows Unix to operate on numerous platforms.\n\n\n== Overview ==\n\nUnix was originally meant to be a convenient platform for programmers developing software to be run on it and on other systems, rather than for non-programmers. The system grew larger as the operating system started spreading in academic circles, and as users added their own tools to the system and shared them with colleagues.At first, Unix was not designed to be portable or for multi-tasking. Later, Unix gradually gained portability, multi-tasking and multi-user capabilities in a time-sharing configuration. Unix systems are characterized by various concepts: the use of plain text for storing data; a hierarchical file system; treating devices and certain types of inter-process communication (IPC) as files; and the use of a large number of software tools, small programs that can be","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["2",{"pageContent":"strung together through a command-line interpreter using pipes, as opposed to using a single monolithic program that includes all of the same functionality. These concepts are collectively known as the \"Unix philosophy\". Brian Kernighan and Rob Pike summarize this in The Unix Programming Environment as \"the idea that the power of a system comes more from the relationships among programs than from the programs themselves\".By the early 1980s, users began seeing Unix as a potential universal operating system, suitable for computers of all sizes. The Unix environment and the client–server program model were essential elements in the development of the Internet and the reshaping of computing as centered in networks rather than in individual computers.\nBoth Unix and the C programming language were developed by AT&T and distributed to government and academic institutions, which led to both being ported to a wider variety of machine families than any other operating system.\nThe Unix operating system consists of many libraries and utilities along with the master control program, the kernel. The kernel provides services to start and stop programs, handles the file system and other common","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["3",{"pageContent":"\"low-level\" tasks that most programs share, and schedules access to avoid conflicts when programs try to access the same resource or device simultaneously. To mediate such access, the kernel has special rights, reflected in the distinction of kernel space from user space, the latter being a priority realm where most application programs operate.\n\n\n== History ==\n\nThe origins of Unix date back to the mid-1960s when the Massachusetts Institute of Technology, Bell Labs, and General Electric were developing Multics, a time-sharing operating system for the GE-645 mainframe computer.\nMultics featured several innovations, but also presented severe problems. Frustrated by the size and complexity of Multics, but not by its goals, individual researchers at Bell Labs started withdrawing from the project. The last to leave were Ken Thompson, Dennis Ritchie, Douglas McIlroy, and Joe Ossanna, who decided to reimplement their experiences in a new project of smaller scale. This new operating system was initially without organizational backing, and also without a name.\nThe new operating system was a single-tasking system. In 1970, the group coined the name Unics for Uniplexed Information and","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["4",{"pageContent":"Computing Service as a pun on Multics, which stood for Multiplexed Information and Computer Services. Brian Kernighan takes credit for the idea, but adds that \"no one can remember\" the origin of the final spelling Unix. Dennis Ritchie, Doug McIlroy, and Peter G. Neumann also credit Kernighan.\nThe operating system was originally written in assembly language, but in 1973, Version 4 Unix was rewritten in C. Version 4 Unix, however, still had many PDP-11 dependent codes, and was not suitable for porting. The first port to another platform was made five years later (1978) for the Interdata 8/32.Bell Labs produced several versions of Unix that are collectively referred to as Research Unix. In 1975, the first source license for UNIX was sold to Donald B. Gillies at the University of Illinois Urbana–Champaign Department of Computer Science (UIUC). UIUC graduate student Greg Chesson, who had worked on the Unix kernel at Bell Labs, was instrumental in negotiating the terms of the license.During the late 1970s and early 1980s, the influence of Unix in academic circles led to large-scale adoption of Unix (BSD and System V) by commercial startups, which in turn led to Unix fragmenting into multiple, similar but","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["5",{"pageContent":"often slightly mutually-incompatible systems including DYNIX, HP-UX, SunOS/Solaris, AIX, and Xenix. In the late 1980s, AT&T Unix System Laboratories and Sun Microsystems developed System V Release 4 (SVR4), which was subsequently adopted by many commercial Unix vendors.\nIn the 1990s, Unix and Unix-like systems grew in popularity and became the operating system of choice for over 90% of the world's top 500 fastest supercomputers, as BSD and Linux distributions were developed through collaboration by a worldwide network of programmers. In 2000, Apple released Darwin, also a Unix system, which became the core of the Mac OS X operating system, later renamed macOS.Unix-like operating systems are widely used in modern servers, workstations, and mobile devices.\n\n\n== Standards ==\n\nIn the late 1980s, an open operating system standardization effort now known as POSIX provided a common baseline for all operating systems; IEEE based POSIX around the common structure of the major competing variants of the Unix system, publishing the first POSIX standard in 1988. In the early 1990s, a separate but very similar effort was started by an industry consortium, the Common Open Software Environment (COSE)","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["6",{"pageContent":"initiative, which eventually became the Single UNIX Specification (SUS) administered by The Open Group. Starting in 1998, the Open Group and IEEE started the Austin Group, to provide a common definition of POSIX and the Single UNIX Specification, which, by 2008, had become the Open Group Base Specification.\nIn 1999, in an effort towards compatibility, several Unix system vendors agreed on SVR4's Executable and Linkable Format (ELF) as the standard for binary and object code files. The common format allows substantial binary compatibility among different Unix systems operating on the same CPU architecture.\nThe Filesystem Hierarchy Standard was created to provide a reference directory layout for Unix-like operating systems; it has mainly been used in Linux.\n\n\n== Components ==\n\nThe Unix system is composed of several components that were originally packaged together. By including the development environment, libraries, documents and the portable, modifiable source code for all of these components, in addition to the kernel of an operating system, Unix was a self-contained software system. This was one of the key reasons it emerged as an important teaching and learning tool and has had","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["7",{"pageContent":"such a broad influence.The inclusion of these components did not make the system large –  the original V7 UNIX distribution, consisting of copies of all of the compiled binaries plus all of the source code and documentation occupied less than 10 MB and arrived on a single nine-track magnetic tape, earning its reputation as a portable system. The printed documentation, typeset from the online sources, was contained in two volumes.\nThe names and filesystem locations of the Unix components have changed substantially across the history of the system. Nonetheless, the V7 implementation is considered by many to have the canonical early structure:\n\nKernel –  source code in /usr/sys, composed of several sub-components:\nconf –  configuration and machine-dependent parts, including boot code\ndev –  device drivers for control of hardware (and some pseudo-hardware)\nsys –  operating system \"kernel\", handling memory management, process scheduling, system calls, etc.\nh –  header files, defining key structures within the system and important system-specific invariables\nDevelopment environment –  early versions of Unix contained a development environment sufficient to recreate the entire system","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["8",{"pageContent":"from source code:\ned –  text editor, for creating source code files\ncc –  C language compiler (first appeared in V3 Unix)\nas –  machine-language assembler for the machine\nld –  linker, for combining object files\nlib –  object-code libraries (installed in /lib or /usr/lib). libc, the system library with C run-time support, was the primary library, but there have always been additional libraries for things such as mathematical functions (libm) or database access. V7 Unix introduced the first version of the modern \"Standard I/O\" library stdio as part of the system library. Later implementations increased the number of libraries significantly.\nmake –  build manager (introduced in PWB/UNIX), for effectively automating the build process\ninclude –  header files for software development, defining standard interfaces and system invariants\nOther languages –  V7 Unix contained a Fortran-77 compiler, a programmable arbitrary-precision calculator (bc, dc), and the awk scripting language; later versions and implementations contain many other language compilers and toolsets. Early BSD releases included Pascal tools, and many modern Unix systems also include the GNU Compiler Collection as well as","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["9",{"pageContent":"or instead of a proprietary compiler system.\nOther tools –  including an object-code archive manager (ar), symbol-table lister (nm), compiler-development tools (e.g. lex & yacc), and debugging tools.\nCommands –  Unix makes little distinction between commands (user-level programs) for system operation and maintenance (e.g. cron), commands of general utility (e.g. grep), and more general-purpose applications such as the text formatting and typesetting package. Nonetheless, some major categories are:\nsh –  the \"shell\" programmable command-line interpreter, the primary user interface on Unix before window systems appeared, and even afterward (within a \"command window\").\nUtilities –  the core toolkit of the Unix command set, including cp, ls, grep, find and many others. Subcategories include:\nSystem utilities –  administrative tools such as mkfs, fsck, and many others.\nUser utilities –  environment management tools such as passwd, kill, and others.\nDocument formatting –  Unix systems were used from the outset for document preparation and typesetting systems, and included many related programs such as nroff, troff, tbl, eqn, refer, and pic. Some modern Unix systems also include","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["10",{"pageContent":"packages such as TeX and Ghostscript.\nGraphics –  the plot subsystem provided facilities for producing simple vector plots in a device-independent format, with device-specific interpreters to display such files. Modern Unix systems also generally include X11 as a standard windowing system and GUI, and many support OpenGL.\nCommunications –  early Unix systems contained no inter-system communication, but did include the inter-user communication programs mail and write. V7 introduced the early inter-system communication system UUCP, and systems beginning with BSD release 4.1c included TCP/IP utilities.\nDocumentation –  Unix was one of the first operating systems to include all of its documentation online in machine-readable form. The documentation included:\nman –  manual pages for each command, library component, system call, header file, etc.\ndoc –  longer documents detailing major subsystems, such as the C language and troff\n\n\n== Impact ==\n\nThe Unix system had a significant impact on other operating systems. It achieved its reputation by its interactivity, by providing the software at a nominal fee for educational use, by running on inexpensive hardware, and by being easy to adapt","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["11",{"pageContent":"and move to different machines. Unix was originally written in assembly language, but was soon rewritten in C, a high-level programming language. Although this followed the lead of CTSS, Multics and Burroughs MCP, it was Unix that popularized the idea.\nUnix had a drastically simplified file model compared to many contemporary operating systems: treating all kinds of files as simple byte arrays. The file system hierarchy contained machine services and devices (such as printers, terminals, or disk drives), providing a uniform interface, but at the expense of occasionally requiring additional mechanisms such as ioctl and mode flags to access features of the hardware that did not fit the simple \"stream of bytes\" model. The Plan 9 operating system pushed this model even further and eliminated the need for additional mechanisms.\nUnix also popularized the hierarchical file system with arbitrarily nested subdirectories, originally introduced by Multics. Other common operating systems of the era had ways to divide a storage device into multiple directories or sections, but they had a fixed number of levels, often only one level. Several major proprietary operating systems eventually added","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["12",{"pageContent":"recursive subdirectory capabilities also patterned after Multics. DEC's RSX-11M's \"group, user\" hierarchy evolved into OpenVMS directories, CP/M's volumes evolved into MS-DOS 2.0+ subdirectories, and HP's MPE group.account hierarchy and IBM's SSP and OS/400 library systems were folded into broader POSIX file systems.\nMaking the command interpreter an ordinary user-level program, with additional commands provided as separate programs, was another Multics innovation popularized by Unix. The Unix shell used the same language for interactive commands as for scripting (shell scripts – there was no separate job control language like IBM's JCL). Since the shell and OS commands were \"just another program\", the user could choose (or even write) their own shell. New commands could be added without changing the shell itself. Unix's innovative command-line syntax for creating modular chains of producer-consumer processes (pipelines) made a powerful programming paradigm (coroutines) widely available. Many later command-line interpreters have been inspired by the Unix shell.\nA fundamental simplifying assumption of Unix was its focus on newline-delimited text for nearly all file","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["13",{"pageContent":"formats. There were no \"binary\" editors in the original version of Unix – the entire system was configured using textual shell command scripts. The common denominator in the I/O system was the byte – unlike \"record-based\" file systems. The focus on text for representing nearly everything made Unix pipes especially useful and encouraged the development of simple, general tools that could be easily combined to perform more complicated ad hoc tasks. The focus on text and bytes made the system far more scalable and portable than other systems. Over time, text-based applications have also proven popular in application areas, such as printing languages (PostScript, ODF), and at the application layer of the Internet protocols, e.g., FTP, SMTP, HTTP, SOAP, and SIP.\nUnix popularized a syntax for regular expressions that found widespread use. The Unix programming interface became the basis for a widely implemented operating system interface standard (POSIX, see above). The C programming language soon spread beyond Unix, and is now ubiquitous in systems and applications programming.\nEarly Unix developers were important in bringing the concepts of modularity and reusability into software","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["14",{"pageContent":"engineering practice, spawning a \"software tools\" movement. Over time, the leading developers of Unix (and programs that ran on it) established a set of cultural norms for developing software, norms which became as important and influential as the technology of Unix itself; this has been termed the Unix philosophy.\nThe TCP/IP networking protocols were quickly implemented on the Unix versions widely used on relatively inexpensive computers, which contributed to the Internet explosion of worldwide real-time connectivity, and which formed the basis for implementations on many other platforms.\nThe Unix policy of extensive on-line documentation and (for many years) ready access to all system source code raised programmer expectations, and contributed to the launch of the free software movement in 1983.\n\n\n=== Free Unix and Unix-like variants ===\n\nIn 1983, Richard Stallman announced the GNU (short for \"GNU's Not Unix\") project, an ambitious effort to create a free software Unix-like system—\"free\" in the sense that everyone who received a copy would be free to use, study, modify, and redistribute it. The GNU project's own kernel development project, GNU Hurd, had not yet produced a working","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["15",{"pageContent":"kernel, but in 1991 Linus Torvalds released the Linux kernel as free software under the GNU General Public License. In addition to their use in the GNU operating system, many GNU packages – such as the GNU Compiler Collection (and the rest of the GNU toolchain), the GNU C library and the GNU core utilities – have gone on to play central roles in other free Unix systems as well.\nLinux distributions, consisting of the Linux kernel and large collections of compatible software have become popular both with individual users and in business. Popular distributions include Red Hat Enterprise Linux, Fedora, SUSE Linux Enterprise, openSUSE, Debian, Ubuntu, Linux Mint, Mandriva Linux, Slackware Linux, Arch Linux and Gentoo.A free derivative of BSD Unix, 386BSD, was released in 1992 and led to the NetBSD and FreeBSD projects. With the 1994 settlement of a lawsuit brought against the University of California and Berkeley Software Design Inc. (USL v. BSDi) by Unix System Laboratories, it was clarified that Berkeley had the right to distribute BSD Unix for free if it so desired. Since then, BSD Unix has been developed in several different product branches, including OpenBSD and DragonFly BSD.\nLinux and BSD are","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["16",{"pageContent":"increasingly filling the market needs traditionally served by proprietary Unix operating systems, as well as expanding into new markets such as the consumer desktop and mobile and embedded devices. Because of the modular design of the Unix model, sharing components is relatively common; consequently, most or all Unix and Unix-like systems include at least some BSD code, and some systems also include GNU utilities in their distributions.\nIn a 1999 interview, Dennis Ritchie voiced his opinion that Linux and BSD operating systems are a continuation of the basis of the Unix design, and are derivatives of Unix:\nI think the Linux phenomenon is quite delightful, because it draws so strongly on the basis that Unix provided. Linux seems to be the among the healthiest of the direct Unix derivatives, though there are also the various BSD systems as well as the more official offerings from the workstation and mainframe manufacturers.\nIn the same interview, he states that he views both Unix and Linux as \"the continuation of ideas that were started by Ken and me and many others, many years ago\".OpenSolaris was the free software counterpart to Solaris developed by Sun Microsystems, which included a","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["17",{"pageContent":"CDDL-licensed kernel and a primarily GNU userland. However, Oracle discontinued the project upon their acquisition of Sun, which prompted a group of former Sun employees and members of the OpenSolaris community to fork OpenSolaris into the illumos kernel. As of 2014, illumos remains the only active open-source System V derivative.\n\n\n=== ARPANET ===\nIn May 1975, RFC 681 described the development of Network Unix by the Center for Advanced Computation at the University of Illinois Urbana-Champaign. The Unix system was said to \"present several interesting capabilities as an ARPANET mini-host\". At the time, Unix required a license from Bell Telephone Laboratories that cost US$20,000 for non-university institutions, while universities could obtain a license for a nominal fee of $150. It was noted that Bell was \"open to suggestions\" for an ARPANET-wide license.\nThe RFC specifically mentions that Unix \"offers powerful local processing facilities in terms of user programs, several compilers, an editor based on QED, a versatile document preparation system, and an efficient file system featuring sophisticated access control, mountable and de-mountable volumes, and a unified treatment of","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["18",{"pageContent":"peripherals as special files.\" The latter permitted the Network Control Program (NCP) to be integrated within the Unix file system, treating network connections as special files that could be accessed through standard Unix I/O calls, which included the added benefit of closing all connections on program exit, should the user neglect to do so. In order \"to minimize the amount of code added to the basic Unix kernel\", much of the NCP code ran in a swappable user process, running only when needed.\n\n\n== Branding ==\n\nIn October 1993, Novell, the company that owned the rights to the Unix System V source at the time, transferred the trademarks of Unix to the X/Open Company (now The Open Group), and in 1995 sold the related business operations to Santa Cruz Operation (SCO). Whether Novell also sold the copyrights to the actual software was the subject of a federal lawsuit in 2006, SCO v. Novell, which Novell won. The case was appealed, but on August 30, 2011, the United States Court of Appeals for the Tenth Circuit affirmed the trial decisions, closing the case. Unix vendor SCO Group Inc. accused Novell of slander of title.\nThe present owner of the trademark UNIX is The Open Group, an industry standards consortium.","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["19",{"pageContent":"Only systems fully compliant with and certified to the Single UNIX Specification qualify as \"UNIX\" (others are called \"Unix-like\").\nBy decree of The Open Group, the term \"UNIX\" refers more to a class of operating systems than to a specific implementation of an operating system; those operating systems which meet The Open Group's Single UNIX Specification should be able to bear the UNIX 98 or UNIX 03 trademarks today, after the operating system's vendor pays a substantial certification fee and annual trademark royalties to The Open Group. Systems that have been licensed to use the UNIX trademark include AIX, EulerOS, HP-UX, Inspur K-UX, IRIX, macOS, Solaris, Tru64 UNIX (formerly \"Digital UNIX\", or OSF/1), and z/OS. Notably, EulerOS and Inspur K-UX are Linux distributions certified as UNIX 03 compliant.Sometimes a representation like Un*x, *NIX, or *N?X is used to indicate all operating systems similar to Unix. This comes from the use of the asterisk (*) and the question mark characters as wildcard indicators in many utilities. This notation is also used to describe other Unix-like systems that have not met the requirements for UNIX branding from the Open Group.\nThe Open Group requests that UNIX","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["20",{"pageContent":"always be used as an adjective followed by a generic term such as system to help avoid the creation of a genericized trademark.\nUnix was the original formatting, but the usage of UNIX remains widespread because it was once typeset in small caps (Unix). According to Dennis Ritchie, when presenting the original Unix paper to the third Operating Systems Symposium of the American Association for Computing Machinery (ACM), \"we had a new typesetter and troff had just been invented and we were intoxicated by being able to produce small caps\". Many of the operating system's predecessors and contemporaries used all-uppercase lettering, so many people wrote the name in upper case due to force of habit. It is not an acronym.Trademark names can be registered by different entities in different countries and trademark laws in some countries allow the same trademark name to be controlled by two different entities if each entity uses the trademark in easily distinguishable categories. The result is that Unix has been used as a brand name for various products including bookshelves, ink pens, bottled glue, diapers, hair driers and food containers.Several plural forms of Unix are used casually to refer to multiple","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["21",{"pageContent":"brands of Unix and Unix-like systems. Most common is the conventional Unixes, but Unices, treating Unix as a Latin noun of the third declension, is also popular. The pseudo-Anglo-Saxon plural form Unixen is not common, although occasionally seen. Sun Microsystems, developer of the Solaris variant, has asserted that the term Unix is itself plural, referencing its many implementations.\n\n\n== See also ==\nComparison of operating systems and free and proprietary software\nList of operating systems, Unix systems, and Unix commands\nPlan 9 from Bell Labs\nTimeline of operating systems\nUnix time\nMarket share of operating systems\nYear 2038 problem\n\n\n== References ==\n\n\n== Further reading ==\nGeneralRitchie, D.M.; Thompson, K. (July–August 1978). \"The UNIX Time-Sharing System\". Bell System Technical Journal. 57 (6). Archived from the original on November 3, 2010.\n\"UNIX History\". www.levenez.com. Retrieved March 17, 2005.\n\"AIX, FreeBSD, HP-UX, Linux, Solaris, Tru64\". UNIXguide.net. Retrieved March 17, 2005.\n\"Linux Weekly News, February 21, 2002\". lwn.net. Retrieved April 7, 2006.\nLions, John: Lions' \"Commentary on the Sixth Edition UNIX Operating System\". with Source Code,","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["22",{"pageContent":"Peer-to-Peer Communications, 1996; ISBN 1-57398-013-7BooksSalus, Peter H.: A Quarter Century of UNIX, Addison Wesley, June 1, 1994; ISBN 0-201-54777-5TelevisionComputer Chronicles (1985). \"UNIX\".\nComputer Chronicles (1989). \"Unix\".TalksKen Thompson (2019). \"VCF East 2019 -- Brian Kernighan interviews Ken Thompson\" (Interview).\nDr Marshall Kirk McKusick (2006). History of the Berkeley Software Distributions (three one-hour lectures).\n\n\n== External links ==\n\nThe UNIX Standard, at The Open Group.\nThe Evolution of the Unix Time-sharing System at the Wayback Machine (archived April 8, 2015)\nThe Creation of the UNIX Operating System at the Wayback Machine (archived April 2, 2014)\nThe Unix Tree: files from historic releases\nUnix History Repository — a git repository representing a reconstructed version of the Unix history on GitHub\nUnix at Curlie\nThe Unix 1st Edition Manual\n1st Edition manual rendered to HTML\nAT&T Tech Channel Archive: The UNIX Operating System: Making Computers More Productive (1982) on YouTube  (film about Unix featuring Dennis Ritchie, Ken Thompson, Brian Kernighan, Alfred Aho, and more)\nAT&T Tech Channel Archive: The UNIX System: Making Computers","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["23",{"pageContent":"Easier to Use (1982) on YouTube  (complementary film to the preceding \"Making Computers More Productive\")\naudio bsdtalk170 - Marshall Kirk McKusick at DCBSDCon -- on history of tcp/ip (in BSD) -- abridgement of the three lectures on the history of BSD.\nA History of UNIX before Berkeley: UNIX Evolution: 1975-1984\nBYTE Magazine, September 1986: UNIX and the MC68000 –  a software perspective on the MC68000 CPU architecture and UNIX compatibility","metadata":{"source":"https://en.wikipedia.org/wiki/Unix"}}],["24",{"pageContent":"Windows is a group of several proprietary graphical operating system families developed and marketed by Microsoft. Each family caters to a certain sector of the computing industry. For example, Windows NT for consumers, Windows Server for servers, and Windows IoT for embedded systems. Defunct Windows families include Windows 9x, Windows Mobile, and Windows Phone.\nThe first version of Windows was released on November 20, 1985, as a graphical operating system shell for MS-DOS in response to the growing interest in graphical user interfaces (GUIs).Windows is the most popular desktop operating system in the world, with 75% market share as of April 2022, according to StatCounter. However, Windows is not the most used operating system when including both mobile and desktop OSes, due to Android's massive growth.As of September 2022, the most recent version of Windows is Windows 11 for consumer PCs and tablets, Windows 11 Enterprise for corporations, and Windows Server 2022 for servers.\n\n\n== Genealogy ==\n\n\n=== By marketing role ===\nMicrosoft, the developer of Windows, has registered several trademarks, each of which denotes a family of Windows operating systems that target a specific sector of","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["25",{"pageContent":"the computing industry. As of 2014, the following Windows families were being actively developed:\n\nWindows NT: Started as a family of operating systems with Windows NT 3.1, an operating system for server computers and workstations. It now consists of three operating system subfamilies that are released almost at the same time and share the same kernel:\nWindows: The operating system for mainstream personal computers and tablets. The latest version is Windows 11. The main competitor of this family is macOS by Apple for personal computers and iPadOS and Android for tablets (c.f. Usage share of operating systems § Market share by category).\nWindows Server: The operating system for server computers. The latest version is Windows Server 2022. Unlike its client sibling, it has adopted a strong naming scheme. The main competitor of this family is Linux. (c.f. Usage share of operating systems § Market share by category)\nWindows PE: A lightweight version of its Windows sibling, meant to operate as a live operating system, used for installing Windows on bare-metal computers (especially on many computers at once), recovery or troubleshooting purposes. The latest version is Windows PE 10.\nWindows IoT","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["26",{"pageContent":"(previously Windows Embedded): Initially, Microsoft developed Windows CE as a general-purpose operating system for every device that was too resource-limited to be called a full-fledged computer. Eventually, however, Windows CE was renamed Windows Embedded Compact and was folded under Windows Compact trademark which also consists of Windows Embedded Industry, Windows Embedded Professional, Windows Embedded Standard, Windows Embedded Handheld and Windows Embedded Automotive.The following Windows families are no longer being developed:\n\nWindows 9x: An operating system that targeted the consumer market. Discontinued because of suboptimal performance. (PC World called its last version, Windows Me, one of the worst products of all time.) Microsoft now caters to the consumer market with Windows NT.\nWindows Mobile: The predecessor to Windows Phone, it was a mobile phone operating system. The first version was called Pocket PC 2000; the third version, Windows Mobile 2003 is the first version to adopt the Windows Mobile trademark. The last version is Windows Mobile 6.5.\nWindows Phone: An operating system sold only to manufacturers of smartphones. The first version was Windows Phone","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["27",{"pageContent":"7, followed by Windows Phone 8, and Windows Phone 8.1. It was succeeded by Windows 10 Mobile, which is now also discontinued.\n\n\n== Version history ==\n\nThe term Windows collectively describes any or all of several generations of Microsoft operating system products. These products are generally categorized as follows:\n\n\n=== Early versions ===\n\nThe history of Windows dates back to 1981 when Microsoft started work on a program called \"Interface Manager\". It was announced in November 1983 (after the Apple Lisa, but before the Macintosh) under the name \"Windows\", but Windows 1.0 was not released until November 1985. Windows 1.0 was to compete with Apple's operating system, but achieved little popularity.  Windows 1.0 is not a complete operating system; rather, it extends MS-DOS. The shell of Windows 1.0 is a program known as the MS-DOS Executive. Components included Calculator, Calendar, Cardfile, Clipboard Viewer, Clock, Control Panel, Notepad, Paint, Reversi, Terminal and Write. Windows 1.0 does not allow overlapping windows. Instead, all windows are tiled. Only modal dialog boxes may appear over other windows. Microsoft sold as included Windows Development libraries with the C","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["28",{"pageContent":"development environment, which included numerous windows samples.Windows 2.0 was released in December 1987, and was more popular than its predecessor. It features several improvements to the user interface and memory management. Windows 2.03 changed the OS from tiled windows to overlapping windows. The result of this change led to Apple Computer filing a suit against Microsoft alleging infringement on Apple's copyrights (eventually settled in court in Microsoft's favor in 1993). Windows 2.0 also introduced more sophisticated keyboard shortcuts and could make use of expanded memory.\nWindows 2.1 was released in two different versions: Windows/286 and Windows/386. Windows/386 uses the virtual 8086 mode of the Intel 80386 to multitask several DOS programs and the paged memory model to emulate expanded memory using available extended memory. Windows/286, in spite of its name, runs on both Intel 8086 and Intel 80286 processors. It runs in real mode but can make use of the high memory area.In addition to full Windows packages, there were runtime-only versions that shipped with early Windows software from third parties and made it possible to run their Windows software on MS-DOS and without the","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["29",{"pageContent":"full Windows feature set.\nThe early versions of Windows are often thought of as graphical shells, mostly because they ran on top of MS-DOS and used it for file system services. However, even the earliest Windows versions already assumed many typical operating system functions; notably, having their own executable file format and providing their own device drivers (timer, graphics, printer, mouse, keyboard and sound). Unlike MS-DOS, Windows allowed users to execute multiple graphical applications at the same time, through cooperative multitasking. Windows implemented an elaborate, segment-based, software virtual memory scheme, which allows it to run applications larger than available memory: code segments and resources are swapped in and thrown away when memory became scarce; data segments moved in memory when a given application had relinquished processor control.\n\n\n=== Windows 3.x ===\n\nWindows 3.0, released in 1990, improved the design, mostly because of virtual memory and loadable virtual device drivers (VxDs) that allow Windows to share arbitrary devices between multi-tasked DOS applications. Windows 3.0 applications can run in protected mode, which gives them access to","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["30",{"pageContent":"several megabytes of memory without the obligation to participate in the software virtual memory scheme. They run inside the same address space, where the segmented memory provides a degree of protection. Windows 3.0 also featured improvements to the user interface. Microsoft rewrote critical operations from C into assembly. Windows 3.0 was the first version of Windows to achieve broad commercial success, selling 2 million copies in the first six months.\n  \nWindows 3.1, made generally available on March 1, 1992, featured a facelift. In August 1993, Windows for Workgroups, a special version with integrated peer-to-peer networking features and a version number of 3.11, was released. It was sold along with Windows 3.1. Support for Windows 3.1 ended on December 31, 2001.Windows 3.2, released in 1994, is an updated version of the Chinese version of Windows 3.1. The update was limited to this language version, as it fixed only issues related to the complex writing system of the Chinese language. Windows 3.2 was generally sold by computer manufacturers with a ten-disk version of MS-DOS that also had Simplified Chinese characters in basic output and some translated utilities.\n\n\n=== Windows 9x","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["31",{"pageContent":"===\n\nThe next major consumer-oriented release of Windows, Windows 95, was released on August 24, 1995. While still remaining MS-DOS-based, Windows 95 introduced support for native 32-bit applications, plug and play hardware, preemptive multitasking, long file names of up to 255 characters, and provided increased stability over its predecessors. Windows 95 also introduced a redesigned, object oriented user interface, replacing the previous Program Manager with the Start menu, taskbar, and Windows Explorer shell. Windows 95 was a major commercial success for Microsoft; Ina Fried of CNET remarked that \"by the time Windows 95 was finally ushered off the market in 2001, it had become a fixture on computer desktops around the world.\" Microsoft published four OEM Service Releases (OSR) of Windows 95, each of which was roughly equivalent to a service pack. The first OSR of Windows 95 was also the first version of Windows to be bundled with Microsoft's web browser, Internet Explorer. Mainstream support for Windows 95 ended on December 31, 2000, and extended support for Windows 95 ended on December 31, 2001.Windows 95 was followed up with the release of Windows 98 on June 25, 1998, which introduced the","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["32",{"pageContent":"Windows Driver Model, support for USB composite devices, support for ACPI, hibernation, and support for multi-monitor configurations. Windows 98 also included integration with Internet Explorer 4 through Active Desktop and other aspects of the Windows Desktop Update (a series of enhancements to the Explorer shell which was also made available for Windows 95). In May 1999, Microsoft released Windows 98 Second Edition, an updated version of Windows 98. Windows 98 SE added Internet Explorer 5.0 and Windows Media Player 6.2 amongst other upgrades. Mainstream support for Windows 98 ended on June 30, 2002, and extended support for Windows 98 ended on July 11, 2006.On September 14, 2000, Microsoft released Windows Me (Millennium Edition), the last DOS-based version of Windows. Windows Me incorporated visual interface enhancements from its Windows NT-based counterpart Windows 2000, had faster boot times than previous versions (which however, required the removal of the ability to access a real mode DOS environment, removing compatibility with some older programs), expanded multimedia functionality (including Windows Media Player 7, Windows Movie Maker, and the Windows Image Acquisition","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["33",{"pageContent":"framework for retrieving images from scanners and digital cameras), additional system utilities such as System File Protection and System Restore, and updated home networking tools. However, Windows Me was faced with criticism for its speed and instability, along with hardware compatibility issues and its removal of real mode DOS support. PC World considered Windows Me to be one of the worst operating systems Microsoft had ever released, and the fourth worst tech product of all time.\n\n\n=== Windows NT ===\n\n\n==== Version history ====\n\n\n===== Early versions (Windows NT 3.1/3.5/3.51/4.0/2000) =====\n\nIn November 1988, a new development team within Microsoft (which included former Digital Equipment Corporation developers Dave Cutler and Mark Lucovsky) began work on a revamped version of IBM and Microsoft's OS/2 operating system known as \"NT OS/2\". NT OS/2 was intended to be a secure, multi-user operating system with POSIX compatibility and a modular, portable kernel with preemptive multitasking and support for multiple processor architectures. However, following the successful release of Windows 3.0, the NT development team decided to rework the project to use an extended 32-bit port of","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["34",{"pageContent":"the Windows API known as Win32 instead of those of OS/2. Win32 maintained a similar structure to the Windows APIs (allowing existing Windows applications to easily be ported to the platform), but also supported the capabilities of the existing NT kernel. Following its approval by Microsoft's staff, development continued on what was now Windows NT, the first 32-bit version of Windows. However, IBM objected to the changes, and ultimately continued OS/2 development on its own.Windows NT was the first Windows operating system based on a hybrid kernel. The hybrid kernel was designed as a modified microkernel, influenced by the Mach microkernel developed by Richard Rashid at Carnegie Mellon University, but without meeting all of the criteria of a pure microkernel.\nThe first release of the resulting operating system, Windows NT 3.1 (named to associate it with Windows 3.1) was released in July 1993, with versions for desktop workstations and servers. Windows NT 3.5 was released in September 1994, focusing on performance improvements and support for Novell's NetWare, and was followed up by Windows NT 3.51 in May 1995, which included additional improvements and support for the PowerPC architecture.","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["35",{"pageContent":"Windows NT 4.0 was released in June 1996, introducing the redesigned interface of Windows 95 to the NT series. On February 17, 2000, Microsoft released Windows 2000, a successor to NT 4.0. The Windows NT name was dropped at this point in order to put a greater focus on the Windows brand.\n\n\n===== Windows XP =====\n\nThe next major version of Windows NT, Windows XP, was released on October 25, 2001. The introduction of Windows XP aimed to unify the consumer-oriented Windows 9x series with the architecture introduced by Windows NT, a change which Microsoft promised would provide better performance over its DOS-based predecessors. Windows XP would also introduce a redesigned user interface (including an updated Start menu and a \"task-oriented\" Windows Explorer), streamlined multimedia and networking features, Internet Explorer 6, integration with Microsoft's .NET Passport services, a \"compatibility mode\" to help provide backwards compatibility with software designed for previous versions of Windows, and Remote Assistance functionality.At retail, Windows XP was marketed in two main editions: the \"Home\" edition was targeted towards consumers, while the \"Professional\" edition was targeted","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["36",{"pageContent":"towards business environments and power users, and included additional security and networking features. Home and Professional were later accompanied by the \"Media Center\" edition (designed for home theater PCs, with an emphasis on support for DVD playback, TV tuner cards, DVR functionality, and remote controls), and the \"Tablet PC\" edition (designed for mobile devices meeting its specifications for a tablet computer, with support for stylus pen input and additional pen-enabled applications). Mainstream support for Windows XP ended on April 14, 2009. Extended support ended on April 8, 2014.After Windows 2000, Microsoft also changed its release schedules for server operating systems; the server counterpart of Windows XP, Windows Server 2003, was released in April 2003. It was followed in December 2005, by Windows Server 2003 R2.\n\n\n===== Windows Vista =====\n\nAfter a lengthy development process, Windows Vista was released on November 30, 2006, for volume licensing and January 30, 2007, for consumers. It contained a number of new features, from a redesigned shell and user interface to significant technical changes, with a particular focus on security features. It was available in a","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["37",{"pageContent":"number of different editions, and has been subject to some criticism, such as drop of performance, longer boot time, criticism of new UAC, and stricter license agreement. Vista's server counterpart, Windows Server 2008 was released in early 2008.\n\n\n===== Windows 7 =====\n\nOn July 22, 2009, Windows 7 and Windows Server 2008 R2 were released to manufacturing (RTM) and released to the public 3 months later on October 22, 2009. Unlike its predecessor, Windows Vista, which introduced a large number of new features, Windows 7 was intended to be a more focused, incremental upgrade to the Windows line, with the goal of being compatible with applications and hardware with which Windows Vista was already compatible. Windows 7 has multi-touch support, a redesigned Windows shell with an updated taskbar with revealable jump lists that contain shortcuts to files frequently used with specific applications and shortcuts to tasks within the application, a home networking system called HomeGroup, and performance improvements.\n\n\n===== Windows 8 and 8.1 =====\n\nWindows 8, the successor to Windows 7, was released generally on October 26, 2012. A number of significant changes were made on Windows 8, including the","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["38",{"pageContent":"introduction of a user interface based around Microsoft's Metro design language with optimizations for touch-based devices such as tablets and all-in-one PCs. These changes include the Start screen, which uses large tiles that are more convenient for touch interactions and allow for the display of continually updated information, and a new class of apps which are designed primarily for use on touch-based devices. The new Windows version required a minimum resolution of 1024×768 pixels, effectively making it unfit for netbooks with 800×600-pixel screens.\nOther changes include increased integration with cloud services and other online platforms (such as social networks and Microsoft's own OneDrive (formerly SkyDrive) and Xbox Live services), the Windows Store service for software distribution, and a new variant known as Windows RT for use on devices that utilize the ARM architecture, and a new keyboard shortcut for screenshots. An update to Windows 8, called Windows 8.1, was released on October 17, 2013, and includes features such as new live tile sizes, deeper OneDrive integration, and many other revisions. Windows 8 and Windows 8.1 have been subject to some criticism, such as the removal","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["39",{"pageContent":"of the Start menu.\n\n\n===== Windows 10 =====\n\nOn September 30, 2014, Microsoft announced Windows 10 as the successor to Windows 8.1. It was released on July 29, 2015, and addresses shortcomings in the user interface first introduced with Windows 8. Changes on PC include the return of the Start Menu, a virtual desktop system, and the ability to run Windows Store apps within windows on the desktop rather than in full-screen mode. Windows 10 is said to be available to update from qualified Windows 7 with SP1, Windows 8.1 and Windows Phone 8.1 devices from the Get Windows 10 Application (for Windows 7, Windows 8.1) or Windows Update (Windows 7).In February 2017, Microsoft announced the migration of its Windows source code repository from Perforce to Git. This migration involved 3.5 million separate files in a 300-gigabyte repository. By May 2017, 90 percent of its engineering team was using Git, in about 8500 commits and 1760 Windows builds per day.In June 2021, shortly before Microsoft's announcement of Windows 11, Microsoft updated their lifecycle policy pages for Windows 10, revealing that support for their last release of Windows 10 will end on October 14, 2025.\n\n\n===== Windows 11 =====\n\nOn June 24,","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["40",{"pageContent":"2021, Windows 11 was announced as the successor to Windows 10 during a livestream. The new operating system was designed to be more user-friendly and understandable. It was released on October 5, 2021. As of May 2022, Windows 11 is a free upgrade to Windows 10 users who meet the system requirements.\n\n\n==== Windows 365 ====\n\nIn July 2021, Microsoft announced it will start selling subscriptions to virtualized Windows desktops as part of a new Windows 365 service in the following month. It is not a standalone version of Windows, but a web service that provides access to Windows 10 and Windows 11 built on top of Azure Virtual Desktop. The new service will allow for cross-platform usage, aiming to make the operating system available for both Apple and Android users. The subscription service will be accessible through any operating system with a web browser. The new service is an attempt at capitalizing on the growing trend, fostered during the COVID-19 pandemic, for businesses to adopt a hybrid remote work environment, in which \"employees split their time between the office and home\". As the service will be accessible through web browsers, Microsoft will be able to bypass the need to publish the service","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["41",{"pageContent":"through Google Play or the Apple App Store.Microsoft announced Windows 365 availability to business and enterprise customers on August 2, 2021.\n\n\n==== Multilingual support ====\nMultilingual support has been built into Windows since Windows 3.0. The language for both the keyboard and the interface can be changed through the Region and Language Control Panel. Components for all supported input languages, such as Input Method Editors, are automatically installed during Windows installation (in Windows XP and earlier, files for East Asian languages, such as Chinese, and right-to-left scripts, such as Arabic, may need to be installed separately, also from the said Control Panel). Third-party IMEs may also be installed if a user feels that the provided one is insufficient for their needs.\nInterface languages for the operating system are free for download, but some languages are limited to certain editions of Windows. Language Interface Packs (LIPs) are redistributable and may be downloaded from Microsoft's Download Center and installed for any edition of Windows (XP or later) –  they translate most, but not all, of the Windows interface, and require a certain base language (the language which","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["42",{"pageContent":"Windows originally shipped with). This is used for most languages in emerging markets. Full Language Packs, which translate the complete operating system, are only available for specific editions of Windows (Ultimate and Enterprise editions of Windows Vista and 7, and all editions of Windows 8, 8.1 and RT except Single Language). They do not require a specific base language and are commonly used for more popular languages such as French or Chinese. These languages cannot be downloaded through the Download Center, but are available as optional updates through the Windows Update service (except Windows 8).\nThe interface language of installed applications is not affected by changes in the Windows interface language. The availability of languages depends on the application developers themselves.\nWindows 8 and Windows Server 2012 introduce a new Language Control Panel where both the interface and input languages can be simultaneously changed, and language packs, regardless of type, can be downloaded from a central location. The PC Settings app in Windows 8.1 and Windows Server 2012 R2 also includes a counterpart settings page for this. Changing the interface language also changes the","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["43",{"pageContent":"language of preinstalled Windows Store apps (such as Mail, Maps and News) and certain other Microsoft-developed apps (such as Remote Desktop). The above limitations for language packs are however still in effect, except that full language packs can be installed for any edition except Single Language, which caters to emerging markets.\n\n\n==== Platform support ====\nWindows NT included support for several platforms before the x86-based personal computer became dominant in the professional world. Windows NT 4.0 and its predecessors supported PowerPC, DEC Alpha and MIPS R4000 (although some of the platforms implement 64-bit computing, the OS treated them as 32-bit). Windows 2000 dropped support for all platforms, except the third generation x86 (known as IA-32) or newer in 32-bit mode. The client line of the Windows NT family still runs on IA-32 but the Windows Server line ceased supporting this platform with the release of Windows Server 2008 R2.\nWith the introduction of the Intel Itanium architecture (IA-64), Microsoft released new versions of Windows to support it. Itanium versions of Windows XP and Windows Server 2003 were released at the same time as their mainstream x86 counterparts.","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["44",{"pageContent":"Windows XP 64-Bit Edition, released in 2005, is the last Windows client operating system to support Itanium. Windows Server line continues to support this platform until Windows Server 2012; Windows Server 2008 R2 is the last Windows operating system to support Itanium architecture.\nOn April 25, 2005, Microsoft released Windows XP Professional x64 Edition and Windows Server 2003 x64 Editions to support x86-64 (or simply x64), the 64-bit version of x86 architecture. Windows Vista was the first client version of Windows NT to be released simultaneously in IA-32 and x64 editions. x64 is still supported.\nAn edition of Windows 8 known as Windows RT was specifically created for computers with ARM architecture, and while ARM is still used for Windows smartphones with Windows 10, tablets with Windows RT will not be updated. Starting from Windows 10 Fall Creators Update (version 1709) and later includes support for ARM-based PCs.Windows 11 is the first version to drop support for 32-bit hardware.\n\n\n=== Windows CE ===\n\nWindows CE (officially known as Windows Embedded Compact), is an edition of Windows that runs on minimalistic computers, like satellite navigation systems and some mobile phones.","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["45",{"pageContent":"Windows Embedded Compact is based on its own dedicated kernel, dubbed Windows CE kernel. Microsoft licenses Windows CE to OEMs and device makers. The OEMs and device makers can modify and create their own user interfaces and experiences, while Windows CE provides the technical foundation to do so.\nWindows CE was used in the Dreamcast along with Sega's own proprietary OS for the console. Windows CE was the core from which Windows Mobile was derived. Its successor, Windows Phone 7, was based on components from both Windows CE 6.0 R3 and Windows CE 7.0. Windows Phone 8 however, is based on the same NT-kernel as Windows 8.\nWindows Embedded Compact is not to be confused with Windows XP Embedded or Windows NT 4.0 Embedded, modular editions of Windows based on Windows NT kernel.\n\n\n=== Xbox OS ===\n\nXbox OS is an unofficial name given to the version of Windows that runs on Xbox consoles. From Xbox One onwards it is an implementation with an emphasis on virtualization (using Hyper-V) as it is three operating systems running at once, consisting of the core operating system, a second implemented for games and a more Windows-like environment for applications.\nMicrosoft updates Xbox One's OS every month, and these","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["46",{"pageContent":"updates can be downloaded from the Xbox Live service to the Xbox and subsequently installed, or by using offline recovery images downloaded via a PC. It was originally based on NT 6.2 (Windows 8) kernel, and the latest version runs on an NT 10.0 base. This system is sometimes referred to as \"Windows 10 on Xbox One\" or \"OneCore\".\nXbox One and Xbox Series operating systems also allow limited (due to licensing restrictions and testing resources) backward compatibility with previous generation hardware, and the Xbox 360's system is backwards compatible with the original Xbox.\n\n\n== Version control system ==\nUp to and including every version before Windows 2000, Microsoft used an in-house version control system named Source Library Manager (SLM). Shortly after Windows 2000 was released, Microsoft switched to a fork of Perforce named Source Depot. This system was used up until 2017 once the system couldn't keep up with the size of Windows. Microsoft had begun to integrate Git into Team Foundation Server in 2013, but Windows continued to rely on Source Depot. The Windows code was divided among 65 different repositories with a kind of virtualization layer to produce unified view of all of the code.\nIn 2017","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["47",{"pageContent":"Microsoft announced that it would start using Git, an open source version control system created by Linus Torvalds and in May 2017 they reported that has completed migration into the Git repository.\n\n\n=== VFSForGit ===\nBecause of its large, decades-long history, however, the Windows codebase is not especially well suited to the decentralized nature of Linux development that Git was originally created to manage. Each Git repository contains a complete history of all the files, which proved unworkable for Windows developers because cloning the whole repository takes several hours. Microsoft has been working on a new project called the Virtual File System for Git (VFSForGit) to address these challenges.In 2021 the VFS for Git has been superseded by Scalar.\n\n\n== Timeline of releases ==\n\n\n== Usage share and device sales ==\n\nUse of Windows 10 has exceeded Windows 7 globally since early 2018.For desktop and laptop computers, according to Net Applications and StatCounter, which track the use of operating systems in devices that are active on the Web, Windows was the most used operating-system family in August 2021, with around 91% usage share according to Net Applications and around 76% usage share","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["48",{"pageContent":"according to StatCounter.Including personal computers of all kinds (e.g., desktops, laptops, mobile devices, and game consoles), Windows OSes accounted for 32.67% of usage share in August 2021, compared to Android (highest, at 46.03%), iOS's 13.76%, iPadOS's 2.81%, and macOS's 2.51%, according to Net Applications and 30.73% of usage share in August 2021, compared to Android (highest, at 42.56%), iOS/iPadOS's 16.53%, and macOS's 6.51%, according to StatCounter.Those statistics do not include servers (including so-called cloud computing, where Microsoft is known not to be a leader, with Linux used more than Windows), as Net Applications and StatCounter use web browsing as a proxy for all use.\n\n\n== Security ==\nEarly versions of Windows were designed at a time where malware and networking were less common, and had few built-in security features; they did not provide access privileges to allow a user to prevent other users from accessing their files, and they did not provide memory protection to prevent one process from reading or writing another process's address space or to prevent a process from code or data used by privileged-mode code.\nWhile the Windows 9x series offered the option of","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["49",{"pageContent":"having profiles for multiple users, it had no concept of access privileges, allowing any user to edit others' files, however, Windows 98 included each profile to have their own My folders (My Documents, My Pictures, My Music, etc) separate from other profiles.  In addition, while it ran separate 32-bit applications in separate address spaces, protecting an application's code and data from being read or written by another application, it did not protect the first megabyte of memory from userland applications for compatibility reasons. This area of memory contains code critical to the functioning of the operating system, and by writing into this area of memory an application can crash or freeze the operating system. This was a source of instability as faulty applications could accidentally write into this region, potentially corrupting important operating system memory, which usually resulted in some form of system error and halt.Windows NT was far more secure, implementing access privileges and full memory protection, and, while 32-bit programs  meeting the DoD's C2 security rating, yet these advantages were nullified by the fact that, prior to Windows Vista, the default user account created","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["50",{"pageContent":"during the setup process was an administrator account; the user, and any program the user launched, had full access to the machine. Though Windows XP did offer an option of turning administrator accounts into limited accounts, the majority of home users did not do so, partially due to the number of programs which required administrator rights to function properly. As a result, most home users still ran as administrator all the time. These architectural flaws, combined with Windows's very high popularity, made Windows a frequent target of computer worm and virus writers.Furthermore, although Windows NT and its successors are designed for security (including on a network) and multi-user PCs, they were not initially designed with Internet security in mind as much, since, when it was first developed in the early 1990s, Internet use was less prevalent.In a 2002 strategy memo entitled \"Trustworthy computing\" sent to every Microsoft employee, Bill Gates declared that security should become Microsoft's highest priority.Windows Vista introduced a privilege elevation system called User Account Control. When logging in as a standard user, a logon session is created and a token containing only the most","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["51",{"pageContent":"basic privileges is assigned. In this way, the new logon session is incapable of making changes that would affect the entire system. When logging in as a user in the Administrators group, two separate tokens are assigned. The first token contains all privileges typically awarded to an administrator, and the second is a restricted token similar to what a standard user would receive. User applications, including the Windows shell, are then started with the restricted token, resulting in a reduced privilege environment even under an Administrator account. When an application requests higher privileges or \"Run as administrator\" is clicked, UAC will prompt for confirmation and, if consent is given (including administrator credentials if the account requesting the elevation is not a member of the administrators group), start the process using the unrestricted token.Leaked documents published by WikiLeaks, codenamed Vault 7 and dated from 2013 to 2016, detail the capabilities of the CIA to perform electronic surveillance and cyber warfare, such as the ability to compromise operating systems such as Windows.In August 2019, computer experts reported that the BlueKeep security vulnerability,","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["52",{"pageContent":"CVE-2019-0708, that potentially affects older unpatched Windows versions via the program's Remote Desktop Protocol, allowing for the possibility of remote code execution, may now include related flaws, collectively named DejaBlue, affecting newer Windows versions (i.e., Windows 7 and all recent versions) as well. In addition, experts reported a Microsoft security vulnerability, CVE-2019-1162, based on legacy code involving Microsoft CTF and ctfmon (ctfmon.exe), that affects all Windows versions from Windows XP to the then most recent Windows 10 versions; a patch to correct the flaw is currently available.Microsoft releases security patches through its Windows Update service approximately once a month (usually the second Tuesday of the month), although critical updates are made available at shorter intervals when necessary. Versions subsequent to Windows 2000 SP3 and Windows XP implemented automatic download and installation of updates, substantially increasing the number of users installing security updates.Today, Windows integrates the Windows Defender antivirus, which is seen as one of the best available. Windows also implements Secure Boot, Control Flow Guard,","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["53",{"pageContent":"ransomware protection, BitLocker disk encryption, a firewall, and Windows SmartScreen.\n\n\n=== File permissions ===\nAll Windows versions from Windows NT 3 have been based on a file system permission system referred to as AGDLP (Accounts, Global, Domain Local, Permissions) in which file permissions are applied to the file/folder in the form of a 'local group' which then has other 'global groups' as members. These global groups then hold other groups or users depending on different Windows versions used. This system varies from other vendor products such as Linux and NetWare due to the 'static' allocation of permission being applied directly to the file or folder. However using this process of AGLP/AGDLP/AGUDLP allows a small number of static permissions to be applied and allows for easy changes to the account groups without reapplying the file permissions on the files and folders.\n\n\n== Alternative implementations ==\nOwing to the operating system's popularity, a number of applications have been released that aim to provide compatibility with Windows applications, either as a compatibility layer for another operating system, or as a standalone system that can run software written for","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["54",{"pageContent":"Windows out of the box. These include:\n\nWine – a free and open-source implementation of the Windows API, allowing one to run many Windows applications on x86-based platforms, including UNIX, Linux and macOS. Wine developers refer to it as a \"compatibility layer\" and use Windows-style APIs to emulate Windows environment.\nCrossOver – a Wine package with licensed fonts. Its developers are regular contributors to Wine.\nProton – A fork of Wine by Steam to run Windows games on Linux and other Unix-like OS.\nReactOS – an open-source OS intended to run the same software as Windows, originally designed to simulate Windows NT 4.0, now aiming at Windows 7 compatibility. It has been in the development stage since 1996.\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\n\nOfficial website\nOfficial Windows Blog\nMicrosoft Developer Network\nWindows Developer Center\nMicrosoft Windows History Timeline\nPearson Education, InformIT – History of Microsoft Windows\nMicrosoft Business Software Solutions\nWindows 10 release Information","metadata":{"source":"https://en.wikipedia.org/wiki/Microsoft_Windows"}}],["55",{"pageContent":"Linux ( (listen) LEE-nuuks or  LIN-uuks) is a family of open-source Unix-like operating systems based on the Linux kernel, an operating system kernel first released on September 17, 1991, by Linus Torvalds. Linux is typically packaged as a Linux distribution, which includes the kernel and supporting system software and libraries, many of which are provided by the GNU Project. Many Linux distributions use the word \"Linux\" in their name, but the Free Software Foundation uses the name \"GNU/Linux\" to emphasize the importance of GNU software, causing some controversy.Popular Linux distributions include Debian, Fedora Linux, and Ubuntu, the latter of which itself consists of many different distributions and modifications, including Lubuntu and Xubuntu. Commercial distributions include Red Hat Enterprise Linux and SUSE Linux Enterprise. Desktop Linux distributions include a windowing system such as X11 or Wayland, and a desktop environment such as GNOME or KDE Plasma. Distributions intended for servers may omit graphics altogether, or include a solution stack such as LAMP. Because Linux is freely redistributable, anyone may create a distribution for any purpose.Linux was originally","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["56",{"pageContent":"developed for personal computers based on the Intel x86 architecture, but has since been ported to more platforms than any other operating system. Because of the dominance of the Linux-based Android on smartphones, Linux, including Android, has the largest installed base of all general-purpose operating systems, as of May 2022. Although Linux is, as of November 2022, used by only around 2.6 percent of desktop computers, the Chromebook, which runs the Linux kernel-based ChromeOS, dominates the US K–12 education market and represents nearly 20 percent of sub-$300 notebook sales in the US. Linux is the leading operating system on servers (over 96.4% of the top 1 million web servers' operating systems are Linux), leads other big iron systems such as mainframe computers, and is used on all of the world's 500 fastest supercomputers (since November 2017, having gradually displaced all competitors).Linux also runs on embedded systems, i.e. devices whose operating system is typically built into the firmware and is highly tailored to the system. This includes routers, automation controls, smart home devices, video game consoles, televisions (Samsung and LG Smart TVs), automobiles (Tesla, Audi,","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["57",{"pageContent":"Mercedes-Benz, Hyundai and Toyota), and spacecraft (Falcon 9 rocket, Dragon crew capsule and the Perseverance rover).\nLinux is one of the most prominent examples of free and open-source software collaboration. The source code may be used, modified and distributed commercially or non-commercially by anyone under the terms of its respective licenses, such as the GNU General Public License (GPL). The Linux kernel, for example, is licensed under the GPLv2, with an exception for system calls that allows code that calls the kernel via system calls not to be licensed under the GPL.\n\n\n== History ==\n\n\n=== Precursors ===\n\nThe Unix operating system was conceived and implemented in 1969, at AT&T's Bell Labs, in the United States by Ken Thompson, Dennis Ritchie, Douglas McIlroy, and Joe Ossanna. First released in 1971, Unix was written entirely in assembly language, as was common practice at the time. In 1973, in a key pioneering approach, it was rewritten in the C programming language by Dennis Ritchie (with the exception of some hardware and I/O routines). The availability of a high-level language implementation of Unix made its porting to different computer platforms easier.Due to an earlier antitrust","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["58",{"pageContent":"case forbidding it from entering the computer business, AT&T licensed the operating system's source code as a trade secret to anyone who asked. As a result, Unix grew quickly and became widely adopted by academic institutions and businesses. In 1984, AT&T divested itself of its regional operating companies, and was released from its obligation not to enter the computer business; freed of that obligation, Bell Labs began selling Unix as a proprietary product, where users were not legally allowed to modify it.Onyx Systems began selling early microcomputer-based Unix workstations in 1980. Later, Sun Microsystems, founded as a spin-off of a student project at Stanford University, also began selling Unix-based desktop workstations in 1982. While Sun workstations didn't utilize commodity PC hardware like Linux was later developed for, it represented the first successful commercial attempt at distributing a primarily single-user microcomputer that ran a Unix operating system.With Unix increasingly \"locked in\" as a proprietary product, the GNU Project, started in 1983 by Richard Stallman, had the goal of creating a \"complete Unix-compatible software system\" composed entirely of free","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["59",{"pageContent":"software. Work began in 1984. Later, in 1985, Stallman started the Free Software Foundation and wrote the GNU General Public License (GNU GPL) in 1989. By the early 1990s, many of the programs required in an operating system (such as libraries, compilers, text editors, a command-line shell, and a windowing system) were completed, although low-level elements such as device drivers, daemons, and the kernel, called GNU Hurd, were stalled and incomplete.MINIX was created by Andrew S. Tanenbaum, a computer science professor, and released in 1987 as a minimal Unix-like operating system targeted at students and others who wanted to learn operating system principles. Although the complete source code of MINIX was freely available, the licensing terms prevented it from being free software until the licensing changed in April 2000.Although not released until 1992, due to legal complications, development of 386BSD, from which NetBSD, OpenBSD and FreeBSD descended, predated that of Linux.\nLinus Torvalds has stated on separate occasions that if the GNU kernel or 386BSD had been available at the time (1991), he probably would not have created Linux.\n\n\n=== Creation ===\nWhile attending the University of","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["60",{"pageContent":"Helsinki in the fall of 1990, Torvalds enrolled in a Unix course. The course utilized a MicroVAX minicomputer running Ultrix, and one of the required texts was Operating Systems: Design and Implementation by Andrew S. Tanenbaum. This textbook included a copy of Tanenbaum's MINIX operating system. It was with this course that Torvalds first became exposed to Unix. In 1991, he became curious about operating systems. Frustrated by the licensing of MINIX, which at the time limited it to educational use only, he began to work on his own operating system kernel, which eventually became the Linux kernel.\nTorvalds began the development of the Linux kernel on MINIX and applications written for MINIX were also used on Linux. Later, Linux matured and further Linux kernel development took place on Linux systems. GNU applications also replaced all MINIX components, because it was advantageous to use the freely available code from the GNU Project with the fledgling operating system; code licensed under the GNU GPL can be reused in other computer programs as long as they also are released under the same or a compatible license. Torvalds initiated a switch from his original license, which prohibited commercial","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["61",{"pageContent":"redistribution, to the GNU GPL. Developers worked to integrate GNU components with the Linux kernel, creating a fully functional and free operating system.\n\n\n=== Naming ===\n\nLinus Torvalds had wanted to call his invention \"Freax\", a portmanteau of \"free\", \"freak\", and \"x\" (as an allusion to Unix). During the start of his work on the system, some of the project's makefiles included the name \"Freax\" for about half a year. Initially, Torvalds considered the name \"Linux\" but dismissed it as too egotistical.To facilitate development, the files were uploaded to the FTP server (ftp.funet.fi) of FUNET in September 1991. Ari Lemmke, Torvalds' coworker at the Helsinki University of Technology (HUT) who was one of the volunteer administrators for the FTP server at the time, did not think that \"Freax\" was a good name, so he named the project \"Linux\" on the server without consulting Torvalds. Later, however, Torvalds consented to \"Linux\".\nAccording to a newsgroup post by Torvalds, the word \"Linux\" should be pronounced ( (listen) LIN-uuks) with a short 'i' as in 'print' and 'u' as in 'put'. To further demonstrate how the word \"Linux\" should be pronounced, he included an audio guide with the kernel source code.","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["62",{"pageContent":"However, in this recording, he pronounces Linux as /ˈlinʊks/ (LEEN-uuks) with a short but close front unrounded vowel, instead of a near-close near-front unrounded vowel as in his newsgroup post.\n\n\n=== Commercial and popular uptake ===\n\nAdoption of Linux in production environments, rather than being used only by hobbyists, started to take off first in the mid-1990s in the supercomputing community, where organizations such as NASA started to replace their increasingly expensive machines with clusters of inexpensive commodity computers running Linux. Commercial use began when Dell and IBM, followed by Hewlett-Packard, started offering Linux support to escape Microsoft's monopoly in the desktop operating system market.Today, Linux systems are used throughout computing, from embedded systems to virtually all supercomputers, and have secured a place in server installations such as the popular LAMP application stack. Use of Linux distributions in home and enterprise desktops has been growing. Linux distributions have also become popular in the netbook market, with many devices shipping with customized Linux distributions installed, and Google releasing their own ChromeOS","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["63",{"pageContent":"designed for netbooks.\nLinux's greatest success in the consumer market is perhaps the mobile device market, with Android being the dominant operating system on smartphones and very popular on tablets and, more recently, on wearables. Linux gaming is also on the rise with Valve showing its support for Linux and rolling out SteamOS, its own gaming-oriented Linux distribution, and later the Steam Deck platform. Linux distributions have also gained popularity with various local and national governments, such as the federal government of Brazil.\n\n\n=== Current development ===\n\nGreg Kroah-Hartman is the lead maintainer for the Linux kernel and guides its development. William John Sullivan is the executive director of the Free Software Foundation, which in turn supports the GNU components. Finally, individuals and corporations develop third-party non-GNU components. These third-party components comprise a vast body of work and may include both kernel modules and user applications and libraries.\nLinux vendors and communities combine and distribute the kernel, GNU components, and non-GNU components, with additional package management software in the form of Linux distributions.\n\n\n==","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["64",{"pageContent":"Design ==\n\nMany open source developers agree that the Linux kernel was not designed but rather evolved through natural selection. Torvalds considers that although the design of Unix served as a scaffolding, \"Linux grew with a lot of mutations – and because the mutations were less than random, they were faster and more directed than alpha-particles in DNA.\" Eric S. Raymond considers Linux's revolutionary aspects to be social, not technical: before Linux, complex software was designed carefully by small groups, but \"Linux evolved in a completely different way. From nearly the beginning, it was rather casually hacked on by huge numbers of volunteers coordinating only through the Internet. Quality was maintained not by rigid standards or autocracy but by the naively simple strategy of releasing every week and getting feedback from hundreds of users within days, creating a sort of rapid Darwinian selection on the mutations introduced by developers.\" Bryan Cantrill, an engineer of a competing OS, agrees that \"Linux wasn't designed, it evolved\", but considers this to be a limitation, proposing that some features, especially those related to security, cannot be evolved into, \"this is not a","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["65",{"pageContent":"biological system at the end of the day, it's a software system.\"\nA Linux-based system is a modular Unix-like operating system, deriving much of its basic design from principles established in Unix during the 1970s and 1980s. Such a system uses a monolithic kernel, the Linux kernel, which handles process control, networking, access to the peripherals, and file systems. Device drivers are either integrated directly with the kernel, or added as modules that are loaded while the system is running.The GNU userland is a key part of most systems based on the Linux kernel, with Android being the notable exception. The GNU C library, an implementation of the C standard library, works as a wrapper for the system calls of the Linux kernel necessary to the kernel-userspace interface, the toolchain is a broad collection of programming tools vital to Linux development (including the compilers used to build the Linux kernel itself), and the coreutils implement many basic Unix tools. The GNU Project also develops Bash, a popular CLI shell. The graphical user interface (or GUI) used by most Linux systems is built on top of an implementation of the X Window System. More recently, the Linux community seeks to advance to","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["66",{"pageContent":"Wayland as the new display server protocol in place of X11. Many other open-source software projects contribute to Linux systems.\n\nInstalled components of a Linux system include the following:\nA bootloader, for example GNU GRUB, LILO, SYSLINUX or systemd-boot. This is a program that loads the Linux kernel into the computer's main memory, by being executed by the computer when it is turned on and after the firmware initialization is performed.\nAn init program, such as the traditional sysvinit and the newer systemd, OpenRC and Upstart. This is the first process launched by the Linux kernel, and is at the root of the process tree: in other terms, all processes are launched through init. It starts processes such as system services and login prompts (whether graphical or in terminal mode).\nSoftware libraries, which contain code that can be used by running processes. On Linux systems using ELF-format executable files, the dynamic linker that manages the use of dynamic libraries is known as ld-linux.so. If the system is set up for the user to compile software themselves, header files will also be included to describe the programming interface of installed libraries. Besides the most commonly used","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["67",{"pageContent":"software library on Linux systems, the GNU C Library (glibc), there are numerous other libraries, such as SDL and Mesa.\nC standard library is the library needed to run C programs on a computer system, with the GNU C Library being the standard. For embedded systems, alternatives such as the musl, EGLIBC (a glibc fork once used by Debian) and uClibc (which was designed for uClinux) have been developed, although the last two are no longer maintained. Android uses its own C library, Bionic.\nBasic Unix commands, with GNU coreutils being the standard implementation. Alternatives exist for embedded systems, such as the copyleft BusyBox, and the BSD-licensed Toybox.\nWidget toolkits are the libraries used to build graphical user interfaces (GUIs) for software applications. Numerous widget toolkits are available, including GTK and Clutter developed by the GNOME Project, Qt developed by the Qt Project and led by The Qt Company, and Enlightenment Foundation Libraries (EFL) developed primarily by the Enlightenment team.\nA package management system, such as dpkg and RPM. Alternatively packages can be compiled from binary or source tarballs.\nUser interface programs such as command shells or windowing","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["68",{"pageContent":"environments.\n\n\n=== User interface ===\nThe user interface, also known as the shell, is either a command-line interface (CLI), a graphical user interface (GUI), or controls attached to the associated hardware, which is common for embedded systems. For desktop systems, the default user interface is usually graphical, although the CLI is commonly available through terminal emulator windows or on a separate virtual console.\nCLI shells are text-based user interfaces, which use text for both input and output. The dominant shell used in Linux is the Bourne-Again Shell (bash), originally developed for the GNU Project. Most low-level Linux components, including various parts of the userland, use the CLI exclusively. The CLI is particularly suited for automation of repetitive or delayed tasks and provides very simple inter-process communication.\nOn desktop systems, the most popular user interfaces are the GUI shells, packaged together with extensive desktop environments, such as KDE Plasma, GNOME, MATE, Cinnamon, LXDE, Pantheon and Xfce, though a variety of additional user interfaces exist. Most popular user interfaces are based on the X Window System, often simply called \"X\". It provides","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["69",{"pageContent":"network transparency and permits a graphical application running on one system to be displayed on another where a user may interact with the application; however, certain extensions of the X Window System are not capable of working over the network. Several X display servers exist, with the reference implementation, X.Org Server, being the most popular.\nServer distributions might provide a command-line interface for developers and administrators, but provide a custom interface towards end-users, designed for the use-case of the system. This custom interface is accessed through a client that resides on another system, not necessarily Linux based.\nSeveral types of window managers exist for X11, including tiling, dynamic, stacking and compositing. Window managers provide means to control the placement and appearance of individual application windows, and interact with the X Window System. Simpler X window managers such as dwm, ratpoison, i3wm, or herbstluftwm provide a minimalist functionality, while more elaborate window managers such as FVWM, Enlightenment or Window Maker provide more features such as a built-in taskbar and themes, but are still lightweight when compared to","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["70",{"pageContent":"desktop environments. Desktop environments include window managers as part of their standard installations, such as Mutter (GNOME), KWin (KDE) or Xfwm (xfce), although users may choose to use a different window manager if preferred.\nWayland is a display server protocol intended as a replacement for the X11 protocol; as of 2022, it has received relatively wide adoption. Unlike X11, Wayland does not need an external window manager and compositing manager. Therefore, a Wayland compositor takes the role of the display server, window manager and compositing manager. Weston is the reference implementation of Wayland, while GNOME's Mutter and KDE's KWin are being ported to Wayland as standalone display servers. Enlightenment has already been successfully ported since version 19.\n\n\n=== Video input infrastructure ===\n\nLinux currently has two modern kernel-userspace APIs for handling video input devices: V4L2 API for video streams and radio, and DVB API for digital TV reception.Due to the complexity and diversity of different devices, and due to the large number of formats and standards handled by those APIs, this infrastructure needs to evolve to better fit other devices. Also, a good","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["71",{"pageContent":"userspace device library is the key of the success for having userspace applications to be able to work with all formats supported by those devices.\n\n\n== Development ==\n\nThe primary difference between Linux and many other popular contemporary operating systems is that the Linux kernel and other components are free and open-source software. Linux is not the only such operating system, although it is by far the most widely used. Some free and open-source software licenses are based on the principle of copyleft, a kind of reciprocity: any work derived from a copyleft piece of software must also be copyleft itself. The most common free software license, the GNU General Public License (GPL), is a form of copyleft, and is used for the Linux kernel and many of the components from the GNU Project.Linux-based distributions are intended by developers for interoperability with other operating systems and established computing standards. Linux systems adhere to POSIX, SUS, LSB, ISO, and ANSI standards where possible, although to date only one Linux distribution has been POSIX.1 certified, Linux-FT.Free software projects, although developed through collaboration, are often produced independently of","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["72",{"pageContent":"each other. The fact that the software licenses explicitly permit redistribution, however, provides a basis for larger-scale projects that collect the software produced by stand-alone projects and make it available all at once in the form of a Linux distribution.\nMany Linux distributions manage a remote collection of system software and application software packages available for download and installation through a network connection. This allows users to adapt the operating system to their specific needs. Distributions are maintained by individuals, loose-knit teams, volunteer organizations, and commercial entities. A distribution is responsible for the default configuration of the installed Linux kernel, general system security, and more generally integration of the different software packages into a coherent whole. Distributions typically use a package manager such as apt, yum, zypper, pacman or portage to install, remove, and update all of a system's software from one central location.\n\n\n=== Community ===\n\nA distribution is largely driven by its developer and user communities. Some vendors develop and fund their distributions on a volunteer basis, Debian being a","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["73",{"pageContent":"well-known example. Others maintain a community version of their commercial distributions, as Red Hat does with Fedora, and SUSE does with openSUSE.In many cities and regions, local associations known as Linux User Groups (LUGs) seek to promote their preferred distribution and by extension free software. They hold meetings and provide free demonstrations, training, technical support, and operating system installation to new users. Many Internet communities also provide support to Linux users and developers. Most distributions and free software / open-source projects have IRC chatrooms or newsgroups. Online forums are another means for support, with notable examples being LinuxQuestions.org and the various distribution specific support and community forums, such as ones for Ubuntu, Fedora, and Gentoo. Linux distributions host mailing lists; commonly there will be a specific topic such as usage or development for a given list.\nThere are several technology websites with a Linux focus. Print magazines on Linux often bundle cover disks that carry software or even complete Linux distributions.Although Linux distributions are generally available without charge, several large","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["74",{"pageContent":"corporations sell, support, and contribute to the development of the components of the system and of free software. An analysis of the Linux kernel in 2017 showed that well over 85% of the code developed by programmers who are being paid for their work, leaving about 8.2% to unpaid developers and 4.1% unclassified. Some of the major corporations that provide contributions include Intel, Samsung, Google, AMD, Oracle and Facebook. A number of corporations, notably Red Hat, Canonical and SUSE, have built a significant business around Linux distributions. \nThe free software licenses, on which the various software packages of a distribution built on the Linux kernel are based, explicitly accommodate and encourage commercialization; the relationship between a Linux distribution as a whole and individual vendors may be seen as symbiotic. One common business model of commercial suppliers is charging for support, especially for business users. A number of companies also offer a specialized business version of their distribution, which adds proprietary support packages and tools to administer higher numbers of installations or to simplify administrative tasks.\nAnother business model is to give","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["75",{"pageContent":"away the software to sell hardware. This used to be the norm in the computer industry, with operating systems such as CP/M, Apple DOS and versions of the classic Mac OS prior to 7.6 freely copyable (but not modifiable). As computer hardware standardized throughout the 1980s, it became more difficult for hardware manufacturers to profit from this tactic, as the OS would run on any manufacturer's computer that shared the same architecture.\n\n\n=== Programming on Linux ===\nMost programming languages support Linux either directly or through third-party community based ports. The original development tools used for building both Linux applications and operating system programs are found within the GNU toolchain, which includes the GNU Compiler Collection (GCC) and the GNU Build System. Amongst others, GCC provides compilers for Ada, C, C++, Go and Fortran. Many programming languages have a cross-platform reference implementation that supports Linux, for example PHP, Perl, Ruby, Python, Java, Go, Rust and Haskell. First released in 2003, the LLVM project provides an alternative cross-platform open-source compiler for many languages. Proprietary compilers for Linux include the Intel C++","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["76",{"pageContent":"Compiler, Sun Studio, and IBM XL C/C++ Compiler. BASIC in the form of Visual Basic is supported in such forms as Gambas, FreeBASIC, and XBasic, and in terms of terminal programming or QuickBASIC or Turbo BASIC programming in the form of QB64.\nA common feature of Unix-like systems, Linux includes traditional specific-purpose programming languages targeted at scripting, text processing and system configuration and management in general. Linux distributions support shell scripts, awk, sed and make. Many programs also have an embedded programming language to support configuring or programming themselves. For example, regular expressions are supported in programs like grep and locate, the traditional Unix MTA Sendmail contains its own Turing complete scripting system, and the advanced text editor GNU Emacs is built around a general purpose Lisp interpreter.\nMost distributions also include support for PHP, Perl, Ruby, Python and other dynamic languages. While not as common, Linux also supports C# (via Mono), Vala, and Scheme. Guile Scheme acts as an extension language targeting the GNU system utilities, seeking to make the conventionally small, static, compiled C programs of Unix design","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["77",{"pageContent":"rapidly and dynamically extensible via an elegant, functional high-level scripting system; many GNU programs can be compiled with optional Guile bindings to this end. A number of Java virtual machines and development kits run on Linux, including the original Sun Microsystems JVM (HotSpot), and IBM's J2SE RE, as well as many open-source projects like Kaffe and Jikes RVM.\nGNOME and KDE are popular desktop environments and provide a framework for developing applications. These projects are based on the GTK and Qt widget toolkits, respectively, which can also be used independently of the larger framework. Both support a wide variety of languages. There are a number of Integrated development environments available including Anjuta, Code::Blocks, CodeLite, Eclipse, Geany, ActiveState Komodo, KDevelop, Lazarus, MonoDevelop, NetBeans, and Qt Creator, while the long-established editors Vim, nano and Emacs remain popular.\n\n\n== Hardware support ==\n\nThe Linux kernel is a widely ported operating system kernel, available for devices ranging from mobile phones to supercomputers; it runs on a highly diverse range of computer architectures, including ARM-based Android smartphones and the IBM Z","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["78",{"pageContent":"mainframes. Specialized distributions and kernel forks exist for less mainstream architectures; for example, the ELKS kernel fork can run on Intel 8086 or Intel 80286 16-bit microprocessors, while the µClinux kernel fork may run on systems without a memory management unit. The kernel also runs on architectures that were only ever intended to use a manufacturer-created operating system, such as Macintosh computers (with PowerPC, Intel, and Apple silicon processors), PDAs, video game consoles, portable music players, and mobile phones.\nLinux has a reputation of supporting old hardware very well by maintaining standardized drivers for a long time. There are several industry associations and hardware conferences devoted to maintaining and improving support for diverse hardware under Linux, such as FreedomHEC. Over time, support for different hardware has improved in Linux, resulting in any off-the-shelf purchase having a \"good chance\" of being compatible.In 2014, a new initiative was launched to automatically collect a database of all tested hardware configurations.\n\n\n== Uses ==\n\n\n== Market share and uptake ==\n\nMany quantitative studies of free/open-source software focus on","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["79",{"pageContent":"topics including market share and reliability, with numerous studies specifically examining Linux. The Linux market is growing, and the Linux operating system market size is expected to see a growth of 19.2% by 2027, reaching $15.64 billion, compared to $3.89 billion in 2019. Analysts and proponents attribute the relative success of Linux to its security, reliability, low cost, and freedom from vendor lock-in.\nDesktops and laptops\nAccording to web server statistics (that is, based on the numbers recorded from visits to websites by client devices), as of May 2022, the estimated market share of Linux on desktop computers is around 2.5%. In comparison, Microsoft Windows has a market share of around 75.5%, while macOS covers around 14.9%.Web serversW3Cook publishes stats that use the top 1,000,000 Alexa domains, which as of May 2015 estimate that 96.55% of web servers run Linux, 1.73% run Windows, and 1.72% run FreeBSD.W3Techs publishes stats that use the top 10,000,000 Alexa domains and the top 1,000,000 Tranco domains, updated monthly and as of November 2020 estimate that Linux is used by 39% of the web servers, versus 21.9% being used by Microsoft Windows. 40.1% used other types of Unix.IDC's Q1","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["80",{"pageContent":"2007 report indicated that Linux held 12.7% of the overall server market at that time; this estimate was based on the number of Linux servers sold by various companies, and did not include server hardware purchased separately that had Linux installed on it later.Mobile devices\nAndroid, which is based on the Linux kernel, has become the dominant operating system for smartphones. In July 2022, 71.9% of smartphones accessing the internet worldwide used Android. Android is also a popular operating system for tablets, being responsible for more than 60% of tablet sales as of 2013. According to web server statistics, as of October 2021 Android has a market share of about 71%, with iOS holding 28%, and the remaining 1% attributed to various niche platforms.Film production\nFor years Linux has been the platform of choice in the film industry. The first major film produced on Linux servers was 1997's Titanic. Since then major studios including DreamWorks Animation, Pixar, Weta Digital, and Industrial Light & Magic have migrated to Linux. According to the Linux Movies Group, more than 95% of the servers and desktops at large animation and visual effects companies use Linux.Use in government\nLinux","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["81",{"pageContent":"distributions have also gained popularity with various local and national governments. News of the Russian military creating its own Linux distribution has also surfaced, and has come to fruition as the G.H.ost Project. The Indian state of Kerala has gone to the extent of mandating that all state high schools run Linux on their computers. China uses Linux exclusively as the operating system for its Loongson processor family to achieve technology independence. In Spain, some regions have developed their own Linux distributions, which are widely used in education and official institutions, like gnuLinEx in Extremadura and Guadalinex in Andalusia. France and Germany have also taken steps toward the adoption of Linux. North Korea's Red Star OS, developed since 2002, is based on a version of Fedora Linux.\n\n\n== Copyright, trademark, and naming ==\n\nThe Linux kernel is licensed under the GNU General Public License (GPL), version 2. The GPL requires that anyone who distributes software based on source code under this license must make the originating source code (and any modifications) available to the recipient under the same terms. Other key components of a typical Linux distribution are also","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["82",{"pageContent":"mainly licensed under the GPL, but they may use other licenses; many libraries use the GNU Lesser General Public License (LGPL), a more permissive variant of the GPL, and the X.Org implementation of the X Window System uses the MIT License.\nTorvalds states that the Linux kernel will not move from version 2 of the GPL to version 3. He specifically dislikes some provisions in the new license which prohibit the use of the software in digital rights management. It would also be impractical to obtain permission from all the copyright holders, who number in the thousands.A 2001 study of Red Hat Linux 7.1 found that this distribution contained 30 million source lines of code. Using the Constructive Cost Model, the study estimated that this distribution required about eight thousand person-years of development time. According to the study, if all this software had been developed by conventional proprietary means, it would have cost about US$1.64 billion to develop in 2021 in the United States. Most of the source code (71%) was written in the C programming language, but many other languages were used, including C++, Lisp, assembly language, Perl, Python, Fortran, and various shell scripting languages.","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["83",{"pageContent":"Slightly over half of all lines of code were licensed under the GPL. The Linux kernel itself was 2.4 million lines of code, or 8% of the total.In a later study, the same analysis was performed for Debian version 4.0 (etch, which was released in 2007). This distribution contained close to 283 million source lines of code, and the study estimated that it would have required about seventy three thousand man-years and cost US$9.16 billion (in 2021 dollars) to develop by conventional means. \n\nIn the United States, the name Linux is a trademark registered to Linus Torvalds. Initially, nobody registered it, but on August 15, 1994, William R. Della Croce, Jr. filed for the trademark Linux, and then demanded royalties from Linux distributors. In 1996, Torvalds and some affected organizations sued him to have the trademark assigned to Torvalds, and, in 1997, the case was settled. The licensing of the trademark has since been handled by the Linux Mark Institute (LMI). Torvalds has stated that he trademarked the name only to prevent someone else from using it. LMI originally charged a nominal sublicensing fee for use of the Linux name as part of trademarks, but later changed this in favor of offering a free, perpetual","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["84",{"pageContent":"worldwide sublicense.The Free Software Foundation (FSF) prefers GNU/Linux as the name when referring to the operating system as a whole, because it considers Linux distributions to be variants of the GNU operating system initiated in 1983 by Richard Stallman, president of the FSF. They explicitly take no issue over the name Android for the Android OS, which is also an operating system based on the Linux kernel, as GNU is not a part of it.\nA minority of public figures and software projects other than Stallman and the FSF, notably Debian (which had been sponsored by the FSF up to 1996), also use GNU/Linux when referring to the operating system as a whole. Most media and common usage, however, refers to this family of operating systems simply as Linux, as do many large Linux distributions (for example, SUSE Linux and Red Hat Enterprise Linux). By contrast, Linux distributions containing only free software use \"GNU/Linux\" or simply \"GNU\", such as Trisquel GNU/Linux, Parabola GNU/Linux-libre, BLAG Linux and GNU, and gNewSense.\nAs of May 2011, about 8% to 13% of the lines of code of the Linux distribution Ubuntu (version \"Natty\") is made of GNU components (the range depending on whether GNOME is considered","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["85",{"pageContent":"part of GNU); meanwhile, 6% is taken by the Linux kernel, increased to 9% when including its direct dependencies.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\n\nLinux at Curlie\nGraphical map of Linux Internals\nLinux kernel website and archives\nThe History of Linux in GIT Repository Format 1992–2010","metadata":{"source":"https://en.wikipedia.org/wiki/Linux"}}],["86",{"pageContent":"London is the capital and largest city of England and the United Kingdom, with a population of just under 9 million. It stands on the River Thames in south-east England at the head of a 50-mile (80 km) estuary down to the North Sea, and has been a major settlement for two millennia. The City of London, its ancient core and financial centre, was founded by the Romans as Londinium and retains its medieval boundaries. The City of Westminster, to the west of the City of London, has for centuries hosted the national government and parliament.  Since the 19th century, the name \"London\" has also referred to the metropolis around this core, historically split between the counties of Middlesex, Essex, Surrey, Kent, and Hertfordshire, which since 1965 has largely comprised Greater London, which is governed by 33 local authorities and the Greater London Authority.As one of the world's major global cities, London exerts a strong influence on its arts, entertainment, fashion, commerce and finance, education, health care, media, science and technology, tourism, and transport and communications. Its GDP (€801.66 billion in 2017) makes it the largest urban economy in Europe, and it is one of the major financial centres","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["87",{"pageContent":"in the world. With Europe's largest concentration of higher education institutions, it is home to some of the highest-ranked academic institutions in the world—Imperial College London in natural and applied sciences, the London School of Economics in social sciences, and the comprehensive University College London. London is the most visited city in Europe and has the busiest city airport system in the world. The London Underground is the oldest rapid transit system in the world.London's diverse cultures encompass over 300 languages. The mid-2018 population of Greater London of about 9 million made it Europe's third-most populous city, accounting for 13.4% of the population of the United Kingdom and over 16% of the population of England. The Greater London Built-up Area is the fourth-most populous in Europe with about 9.8 million inhabitants at the 2011 census. The London metropolitan area is the third-most populous in Europe with about 14 million inhabitants in 2016, granting London the status of a megacity.\nLondon has four World Heritage Sites: the Tower of London; Kew Gardens; the combined Palace of Westminster, Westminster Abbey, and St Margaret's Church; and also the historic","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["88",{"pageContent":"settlement in Greenwich, where the Royal Observatory, Greenwich defines the prime meridian (0° longitude) and Greenwich Mean Time. Other landmarks include Buckingham Palace, the London Eye, Piccadilly Circus, St Paul's Cathedral, Tower Bridge, and Trafalgar Square. London has many museums, galleries, libraries and cultural venues, including the British Museum, National Gallery, Natural History Museum, Tate Modern, British Library, and numerous West End theatres. Important sporting events held in London include the FA Cup Final (held annually at Wembley Stadium), Wimbledon Tennis Championships and the London Marathon. In 2012, London became the first city to host three Summer Olympic Games.\n\n\n== Toponymy ==\n\nLondon is an ancient name, already attested in the first century AD, usually in the Latinised form Londinium; for example, handwritten Roman tablets recovered in the city originating from AD 65/70–80 include the word Londinio ('in London').Over the years, the name has attracted many mythically based explanations. The earliest attested appears in Geoffrey of Monmouth's Historia Regum Britanniae, written around 1136.Modern scientific analyses of the name must account for","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["89",{"pageContent":"the origins of the different forms found in early sources: Latin (usually Londinium), Old English (usually Lunden), and Welsh (usually Llundein), with reference to the known developments over time of sounds in those different languages. It is agreed that the name came into these languages from Common Brythonic; recent work tends to reconstruct the lost Celtic form of the name as *Londonjon or something similar. This was adapted into Latin as Londinium and borrowed into Old English.The toponymy of the Common Brythonic form is debated. Prominent was Richard Coates' 1998 argument that it derived from pre-Celtic Old European *(p)lowonida, meaning \"river too wide to ford\". Coates suggested this was a name given to the part of the River Thames that flows through London, from which the settlement gained the Celtic form of its name, *Lowonidonjon. However, most work has accepted a plain Celtic origin. Recent studies favour an explanation of a Celtic derivative of a Proto-Indo-European root *lendh- ('sink, cause to sink'), combined with the Celtic suffix *-injo- or *-onjo- (used to form place-names). Peter Schrijver has specifically suggested that the name originally meant \"place that floods","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["90",{"pageContent":"(periodically, tidally)\".Until 1889, the name \"London\" applied officially only to the City of London, but since then it has also referred to the County of London and to Greater London.In writing, \"London\" is occasionally contracted to \"LDN\". Such usage originated in SMS language and often appears in a social media user profile, suffixing an alias or handle.\n\n\n== History ==\n\n\n=== Prehistory ===\nIn 1993, remains of a Bronze Age bridge were found on the south foreshore upstream from Vauxhall Bridge. This either crossed the Thames or reached a now-lost island in it. Two of the timbers were radiocarbon dated to 1750–1285 BCE.In 2010, foundations of a large timber structure, dated to 4800–4500 BCE, were found on the Thames's south foreshore downstream from Vauxhall Bridge. The function of the mesolithic structure is unclear. Both structures are on the south bank of the Thames, where the now-underground River Effra flows into the Thames.\n\n\n=== Roman London ===\n\nDespite the evidence of scattered Brythonic settlements in the area, the first major settlement was founded by the Romans about four years after the invasion of 43 AD. This only lasted until about 61 AD, when the Iceni tribe led by Queen Boudica","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["91",{"pageContent":"stormed it and burnt it to the ground. The next planned incarnation of Londinium prospered, superseding Colchester as capital of the Roman province of Britannia in 100. At its height in the 2nd century, Roman London had a population of about 60,000.\n\n\n=== Anglo-Saxon and Viking-period London ===\nWith the early 5th-century collapse of Roman rule, London ceased to be a capital and the walled city of Londinium was effectively abandoned, although Roman civilisation continued around St Martin-in-the-Fields until about 450. From about 500, an Anglo-Saxon settlement known as Lundenwic developed slightly west of the old Roman city. By about 680 the city had become a major port again, but there is little evidence of large-scale production. From the 820s repeated Viking assaults brought decline. Three are recorded; those in 851 and 886 succeeded, while the last, in 994, was rebuffed.\n\nThe Vikings applied Danelaw over much of eastern and northern England, its boundary running roughly from London to Chester as an area of political and geographical control imposed by the Viking incursions formally agreed by the Danish warlord, Guthrum and the West Saxon king Alfred the Great in 886. The Anglo-Saxon","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["92",{"pageContent":"Chronicle records that Alfred \"refounded\" London in 886. Archaeological research shows this involved abandonment of Lundenwic and a revival of life and trade within the old Roman walls. London then grew slowly until a dramatic increase in about 950.By the 11th century, London was clearly the largest town in England. Westminster Abbey, rebuilt in Romanesque style by King Edward the Confessor, was one of the grandest churches in Europe. Winchester had been the capital of Anglo-Saxon England, but from this time London became the main forum for foreign traders and the base for defence in time of war. In the view of Frank Stenton: \"It had the resources, and it was rapidly developing the dignity and the political self-consciousness appropriate to a national capital.\"\n\n\n=== Middle Ages ===\n\nAfter winning the Battle of Hastings, William, Duke of Normandy was crowned King of England in newly completed Westminster Abbey on Christmas Day 1066. William built the Tower of London, the first of many such in England rebuilt in stone in the south-eastern corner of the city, to intimidate the inhabitants. In 1097, William II began building Westminster Hall, close by the abbey of the same name. It became the basis of a","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["93",{"pageContent":"new Palace of Westminster.In the 12th century, the institutions of central government, which had hitherto followed the royal English court around the country, grew in size and sophistication and became increasingly fixed, for most purposes at Westminster, although the royal treasury, having been moved from Winchester, came to rest in the Tower. While the City of Westminster developed into a true governmental capital, its distinct neighbour, the City of London, remained England's largest city and principal commercial centre and flourished under its own unique administration, the Corporation of London. In 1100, its population was some 18,000; by 1300 it had grown to nearly 100,000. Disaster struck in the form of the Black Death in the mid-14th century, when London lost nearly a third of its population. London was the focus of the Peasants' Revolt in 1381.London was also a centre of England's Jewish population before their expulsion by Edward I in 1290. Violence against Jews occurred in 1190, when it was rumoured that the new king had ordered their massacre after they had presented themselves at his coronation. In 1264 during the Second Barons' War, Simon de Montfort's rebels killed 500 Jews while","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["94",{"pageContent":"attempting to seize records of debts.\n\n\n=== Early modern ===\n\nDuring the Tudor period the Reformation produced a gradual shift to Protestantism. Much of London property passed from church to private ownership, which accelerated trade and business in the city. In 1475, the Hanseatic League set up a main trading base (kontor) of England in London, called the Stalhof or Steelyard. It remained until 1853, when the Hanseatic cities of Lübeck, Bremen and Hamburg sold the property to South Eastern Railway. Woollen cloth was shipped undyed and undressed from 14th/15th century London to the nearby shores of the Low Countries, where it was considered indispensable.Yet English maritime enterprise hardly reached beyond the seas of north-west Europe. The commercial route to Italy and the Mediterranean was normally through Antwerp and over the Alps; any ships passing through the Strait of Gibraltar to or from England were likely to be Italian or Ragusan. The reopening of the Netherlands to English shipping in January 1565 spurred a burst of commercial activity. The Royal Exchange was founded. Mercantilism grew and monopoly traders such as the East India Company were founded as trade expanded to the New","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["95",{"pageContent":"World. London became the main North Sea port, with migrants arriving from England and abroad. The population rose from about 50,000 in 1530 to about 225,000 in 1605.In the 16th century, William Shakespeare and his contemporaries lived in London during English Renaissance theatre. Shakespeare's Globe Theatre was constructed in 1599 in Southwark. Stage performances came to a halt in London when Puritan authorities shut down the theatres in the 1640s and 1650s. The ban on theatre was lifted during the Restoration in 1660, and London's oldest operating theatre, Drury Lane, opened in 1663 in what is now the West End theatre district.By the end of the Tudor period in 1603, London was still compact. There was an assassination attempt on James I in Westminster, in the Gunpowder Plot of 5 November 1605.\n\nIn 1637, the government of Charles I attempted to reform administration in the London area. This called for the Corporation of the city to extend its jurisdiction and administration over expanding areas around the city. Fearing an attempt by the Crown to diminish the Liberties of London, coupled with a lack of interest in administering these additional areas or concern by city guilds of having to share power,","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["96",{"pageContent":"caused the Corporation's \"The Great Refusal\", a decision which largely continues to account for the unique governmental status of the City.In the English Civil War the majority of Londoners supported the Parliamentary cause. After an initial advance by the Royalists in 1642, culminating in the battles of Brentford and Turnham Green, London was surrounded by a defensive perimeter wall known as the Lines of Communication. The lines were built by up to 20,000 people, and were completed in under two months.\nThe fortifications failed their only test when the New Model Army entered London in 1647, and they were levelled by Parliament the same year.London was plagued by disease in the early 17th century, culminating in the Great Plague of 1665–1666, which killed up to 100,000 people, or a fifth of the population.\n\nThe Great Fire of London broke out in 1666 in Pudding Lane in the city and quickly swept through the wooden buildings. Rebuilding took over ten years and was supervised by polymath Robert Hooke as surveyor for the City of London. In 1708 Christopher Wren's masterpiece, St Paul's Cathedral, was completed. During the Georgian era, new districts such as Mayfair were formed in the west; new bridges over","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["97",{"pageContent":"the Thames encouraged development in South London. In the east, the Port of London expanded downstream. London's development as an international financial centre matured for much of the 18th century.In 1762, George III acquired Buckingham House, which was enlarged over the next 75 years. During the 18th century, London was said to be dogged by crime, and the Bow Street Runners were established in 1750 as a professional police force. A total of more than 200 offences were punishable by death, including petty theft. Epidemics during the 1720s and 30s saw most children born in the city die before reaching their fifth birthday.Coffee-houses became a popular place to debate ideas, as growing literacy and development of the printing press made news widely available, with Fleet Street becoming the centre of the British press. The invasion of Amsterdam by Napoleonic armies led many financiers to relocate to London and the first London international issue was arranged in 1817. Around the same time, the Royal Navy became the world's leading war fleet, acting as a major deterrent to potential economic adversaries. The repeal of the Corn Laws in 1846 was specifically aimed at weakening Dutch economic power.","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["98",{"pageContent":"London then overtook Amsterdam as the leading international financial centre.\nAccording to Samuel Johnson:\n\nYou find no man, at all intellectual, who is willing to leave London. No, Sir, when a man is tired of London, he is tired of life; for there is in London all that life can afford.\n\n\n=== Late modern and contemporary ===\nWith the onset of the Industrial Revolution in Britain, an unprecedented growth in urbanisation took place, and the number of High Streets (the primary street for retail in Britain) rapidly grew. London was the world's largest city from about 1831 to 1925, with a population density of 325 per hectare. In addition to the growing number of stores selling goods such as Harding, Howell & Co. on Pall Mall—a contender for the first department store—the streets had scores of street sellers loudly advertising their goods and services. London's overcrowded conditions led to cholera epidemics, claiming 14,000 lives in 1848, and 6,000 in 1866. Rising traffic congestion led to the creation of the world's first local urban rail network. The Metropolitan Board of Works oversaw infrastructure expansion in the capital and some surrounding counties; it was abolished in 1889 when the London","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["99",{"pageContent":"County Council was created out of county areas surrounding the capital.From the early years of the 20th century onwards, teashops were found on High Streets across London and the rest of Britain, with Lyons, who opened the first of their chain of teashops in Piccadilly in 1894, leading the way. The tearooms, such as the Criterion in Piccadilly, became a popular meeting place for women from the suffrage movement. The city was the target of many attacks during the suffragette bombing and arson campaign, between 1912 and 1914, which saw historic landmarks such as Westminster Abbey and St Paul's Cathedral bombed.\n\nLondon was bombed by the Germans in the First World War, and during the Second World War, the Blitz and other bombings by the German Luftwaffe killed over 30,000 Londoners, destroying large tracts of housing and other buildings across the city.The 1948 Summer Olympics were held at the original Wembley Stadium, while London was still recovering from the war. From the 1940s, London became home to many immigrants, primarily from Commonwealth countries such as Jamaica, India, Bangladesh and Pakistan, making London one of the most diverse cities in the world. In 1951, the Festival of Britain was held","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["100",{"pageContent":"on the South Bank. The Great Smog of 1952 led to the Clean Air Act 1956, which ended the \"pea soup fogs\" for which London had been notorious and had earned it the nickname the \"Big Smoke\".Starting mainly in the mid-1960s, London became a centre for worldwide youth culture, exemplified by the Swinging London sub-culture associated with the King's Road, Chelsea and Carnaby Street. The role of trendsetter revived in the punk era. In 1965 London's political boundaries were expanded in response to the growth of the urban area and a new Greater London Council was created. During The Troubles in Northern Ireland, London was hit from 1973 by bomb attacks by the Provisional Irish Republican Army. These attacks lasted for two decades, starting with the Old Bailey bombing. Racial inequality was highlighted by the 1981 Brixton riot.Greater London's population declined in the decades after the Second World War, from an estimated peak of 8.6 million in 1939 to around 6.8 million in the 1980s. The principal ports for London moved downstream to Felixstowe and Tilbury, with the London Docklands area becoming a focus for regeneration, including the Canary Wharf development. This was born out of London's increasing role","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["101",{"pageContent":"as an international financial centre in the 1980s. The Thames Barrier was completed in the 1980s to protect London against tidal surges from the North Sea.The Greater London Council was abolished in 1986, leaving London with no central administration until 2000 and the creation of the Greater London Authority. To mark the 21st century, the Millennium Dome, London Eye and Millennium Bridge were constructed. On 6 July 2005 London was awarded the 2012 Summer Olympics, as the first city to stage the Olympic Games three times. On 7 July 2005, three London Underground trains and a double-decker bus were bombed in a series of terrorist attacks.In 2008, Time named London alongside New York City and Hong Kong as Nylonkong, hailing them as the world's three most influential global cities. In January 2015, Greater London's population was estimated to be 8.63 million, its highest since 1939. During the Brexit referendum in 2016, the UK as a whole decided to leave the European Union, but most London constituencies voted for remaining.\n\n\n== Administration ==\n\n\n=== Local government ===\n\nThe administration of London is formed of two tiers: a citywide, strategic tier and a local tier. Citywide administration is","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["102",{"pageContent":"coordinated by the Greater London Authority (GLA), while local administration is carried out by 33 smaller authorities. The GLA consists of two elected components: the mayor of London, who has executive powers, and the London Assembly, which scrutinises the mayor's decisions and can accept or reject the mayor's budget proposals each year.\nThe headquarters of the GLA is City Hall, Newham. The mayor since 2016 has been Sadiq Khan, the first Muslim mayor of a major Western capital. The mayor's statutory planning strategy is published as the London Plan, which was most recently revised in 2011. The local authorities are the councils of the 32 London boroughs and the City of London Corporation. They are responsible for most local services, such as local planning, schools, social services, local roads and refuse collection. Certain functions, such as waste management, are provided through joint arrangements. In 2009–2010 the combined revenue expenditure by London councils and the GLA amounted to just over £22 billion (£14.7 billion for the boroughs and £7.4 billion for the GLA).The London Fire Brigade is the statutory fire and rescue service for Greater London, run by the London Fire and Emergency","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["103",{"pageContent":"Planning Authority. It is the third largest fire service in the world. National Health Service ambulance services are provided by the London Ambulance Service (LAS) NHS Trust, the largest free-at-the-point-of-use emergency ambulance service in the world. The London Air Ambulance charity operates in conjunction with the LAS where required. Her Majesty's Coastguard and the Royal National Lifeboat Institution operate on the River Thames, which is under the jurisdiction of the Port of London Authority from Teddington Lock to the sea.\n\n\n=== National government ===\n\nLondon is the seat of the Government of the United Kingdom. Many government departments, as well as the prime minister's residence at 10 Downing Street, are based close to the Palace of Westminster, particularly along Whitehall. There are 73 members of Parliament (MPs) from London, elected from local parliamentary constituencies in the national Parliament. As of December 2019, 49 are from the Labour Party, 21 are Conservatives, and three are Liberal Democrats. The ministerial post of minister for London was created in 1994. As of February 2023, the role of minister for London has been vacant since 27 October 2022.\n\n\n=== Policing","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["104",{"pageContent":"and crime ===\n\nPolicing in Greater London, with the exception of the City of London, is provided by the Metropolitan Police (\"The Met\"), overseen by the mayor through the Mayor's Office for Policing and Crime (MOPAC). The Met is also referred to as Scotland Yard after the location of its original headquarters in a road called Great Scotland Yard in Whitehall. The City of London has its own police force – the City of London Police. The British Transport Police are responsible for police services on National Rail, London Underground, Docklands Light Railway and Tramlink services.\nThe Ministry of Defence Police is a special police force in London, which does not generally become involved with policing the general public.Crime rates vary widely across different areas of London. Crime figures are made available nationally at Local Authority and Ward level. In 2015, there were 118 homicides, a 25.5% increase over 2014. The Metropolitan Police have made detailed crime figures, broken down by category at borough and ward level, available on their website since 2000.Recorded crime has been rising in London, notably violent crime and murder by stabbing and other means have risen. There were 50 murders from","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["105",{"pageContent":"the start of 2018 to mid April 2018. Funding cuts to police in London are likely to have contributed to this, though other factors are also involved.\n\n\n== Geography ==\n\n\n=== Scope ===\n\nLondon, also known as Greater London, is one of nine regions of England and the top subdivision covering most of the city's metropolis. The City of London at its core once comprised the whole settlement, but as its urban area grew, the Corporation of London resisted attempts to amalgamate the City with its suburbs, causing \"London\" to be defined several ways.Forty per cent of Greater London is covered by the London post town, in which 'LONDON' forms part of postal addresses. The London telephone area code (020) covers a larger area, similar in size to Greater London, although some outer districts are excluded and some just outside included. The Greater London boundary has been aligned to the M25 motorway in places.Further urban expansion is now prevented by the Metropolitan Green Belt, although the built-up area extends beyond the boundary in places, producing a separately defined Greater London Urban Area. Beyond this is the vast London commuter belt. Greater London is split for some purposes into Inner London and Outer","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["106",{"pageContent":"London, and by the River Thames into North and South, with an informal central London area. The coordinates of the nominal centre of London, traditionally the original Eleanor Cross at Charing Cross near the junction of Trafalgar Square and Whitehall, are about 51°30′26″N 00°07′39″W. Based on the centre of gravity of its map, the geographical centre of London is in the London Borough of Lambeth, 0.1 miles (150 m) to the north-east of Lambeth North tube station.\n\n\n=== Status ===\nWithin London, both the City of London and the City of Westminster have city status and both the City of London and the remainder of Greater London are counties for the purposes of lieutenancies. The area of Greater London includes areas that are part of the historic counties of Middlesex, Kent, Surrey, Essex and Hertfordshire. London's status as the capital of England, and later the United Kingdom, has never been granted or confirmed by statute or in written form.Its status as a capital was established by constitutional convention, which means its status as de facto capital is a part of the UK's uncodified constitution. The capital of England was moved to London from Winchester as the Palace of Westminster developed in the 12th","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["107",{"pageContent":"and 13th centuries to become the permanent location of the royal court, and thus the political capital of the nation. More recently, Greater London has been defined as a region of England and in this context is known as London.\n\n\n=== Topography ===\n\nGreater London encompasses a total area of 611 square miles (1,583 km2) an area which had a population of 7,172,036 in 2001 and a population density of 11,760 inhabitants per square mile (4,542/km2). The extended area known as the London Metropolitan Region or the London Metropolitan Agglomeration, comprises a total area of 3,236 square miles (8,382 km2) has a population of 13,709,000 and a population density of 3,900 inhabitants per square mile (1,510/km2).Modern London stands on the Thames, its primary geographical feature, a navigable river which crosses the city from the south-west to the east. The Thames Valley is a flood plain surrounded by gently rolling hills including Parliament Hill, Addington Hills, and Primrose Hill. Historically London grew up at the lowest bridging point on the Thames. The Thames was once a much broader, shallower river with extensive marshlands; at high tide, its shores reached five times their present width.Since the","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["108",{"pageContent":"Victorian era the Thames has been extensively embanked, and many of its London tributaries now flow underground. The Thames is a tidal river, and London is vulnerable to flooding. The threat has increased over time because of a slow but continuous rise in high water level caused by climate change and by the slow 'tilting' of the British Isles (up in Scotland and Northern Ireland and down in southern parts of England, Wales and Ireland) as a result of post-glacial rebound.In 1974 a decade of work began on the construction of the Thames Barrier across the Thames at Woolwich to deal with this threat. While the barrier is expected to function as designed until roughly 2070, concepts for its future enlargement or redesign are already being discussed.London has had a small number of earthquakes over the years, notably those of 1750 which macroseismic information indicates had their epicentres directly under the city.  In 2018, two active faults were discovered running parallel to each other, directly under the centre of the city. Furthermore, the city has been damaged at least twice (with fatalities) in the earthquakes of 1382 and 1580. Those earthquakes had their epicentres under the English Channel.","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["109",{"pageContent":"London's building code is being redrawn so that every new structure must be able to withstand an earthquake of at least 6.5 on the Richter scale.\n\n\n=== Climate ===\n\nLondon has a temperate oceanic climate (Köppen: Cfb). Rainfall records have been kept in the city since at least 1697, when records began at Kew. At Kew, the most rainfall in one month is 7.4 inches (189 mm) in November 1755 and the least is 0 inches (0 mm) in both December 1788 and July 1800. Mile End also had 0 inches (0 mm) in April 1893. The wettest year on record is 1903, with a total fall of 38.1 inches (969 mm) and the driest is 1921, with a total fall of 12.1 inches (308 mm). The average annual precipitation amounts to about 600 mm, which is half the annual rainfall of New York City, but also lower than Rome, Lisbon, and Sydney, Australia. Despite its relatively low annual precipitation, London still receives 109.6 rainy days on the 1.0 mm threshold annually. However, London is vulnerable to climate change in the United Kingdom, and there is increasing concern among hydrological experts that London households may run out of water before 2050.Temperature extremes in London range from 40.2 °C (104.4 °F) at Heathrow on 19 July 2022 down to −16.1 °C (3.0","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["110",{"pageContent":"°F) at Northolt on 1 January 1962. Records for atmospheric pressure have been kept at London since 1692. The highest pressure ever reported is 1,049.8 millibars (31.00 inHg) on 20 January 2020.Summers are generally warm, sometimes hot. London's average July high is 23.5 °C (74.3 °F). On average each year, London experiences 31 days above 25 °C (77.0 °F) and 4.2 days above 30.0 °C (86.0 °F). During the 2003 European heat wave, prolonged heat led to hundreds of heat-related deaths. There was also a previous spell of 15 consecutive days above 32.2 °C (90.0 °F) in England in 1976 which also caused many heat related deaths. A previous temperature of 37.8 °C (100.0 °F) in August 1911 at the Greenwich station was later disregarded as non-standard. Droughts can also, occasionally, be a problem, especially in summer, most recently in summer 2018, and with much drier than average conditions prevailing from May to December. However, the most consecutive days without rain was 73 days in the spring of 1893.Winters are generally cool with little temperature variation. Heavy snow is rare but snow usually falls at least once each winter. Spring and autumn can be pleasant. As a large city, London has a considerable urban","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["111",{"pageContent":"heat island effect, making the centre of London at times 5 °C (9 °F) warmer than the suburbs and outskirts. This can be seen below when comparing London Heathrow, 15 miles (24 km) west of London, with the London Weather Centre.\n\n\n=== Areas ===\n\nPlaces within London's vast urban area are identified using area names, such as Mayfair, Southwark, Wembley, and Whitechapel. These are either informal designations, reflect the names of villages that have been absorbed by sprawl, or are superseded administrative units such as parishes or former boroughs.\nSuch names have remained in use through tradition, each referring to a local area with its own distinctive character, but without official boundaries. Since 1965 Greater London has been divided into 32 London boroughs in addition to the ancient City of London. The City of London is the main financial district, and Canary Wharf has recently developed into a new financial and commercial hub in the Docklands to the east.\nThe West End is London's main entertainment and shopping district, attracting tourists. West London includes expensive residential areas where properties can sell for tens of millions of pounds. The average price for properties in","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["112",{"pageContent":"Kensington and Chelsea is over £2 million with a similarly high outlay in most of central London.The East End is the area closest to the original Port of London, known for its high immigrant population, as well as for being one of the poorest areas in London. The surrounding East London area saw much of London's early industrial development; now, brownfield sites throughout the area are being redeveloped as part of the Thames Gateway including the London Riverside and Lower Lea Valley, which was developed into the Olympic Park for the 2012 Olympics and Paralympics.\n\n\n=== Architecture ===\n\nLondon's buildings are too diverse to be characterised by any particular architectural style, partly because of their varying ages. Many grand houses and public buildings, such as the National Gallery, are constructed from Portland stone. Some areas of the city, particularly those just west of the centre, are characterised by white stucco or whitewashed buildings. Few structures in central London pre-date the Great Fire of 1666, these being a few trace Roman remains, the Tower of London and a few scattered Tudor survivors in the city. Further out is, for example, the Tudor-period Hampton Court Palace, England's","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["113",{"pageContent":"oldest surviving Tudor palace, built by Cardinal Thomas Wolsey in about 1515.\n\nPart of the varied architectural heritage are the 17th-century churches by Wren, neoclassical financial institutions such as the Royal Exchange and the Bank of England, to the early 20th century Old Bailey and the 1960s Barbican Estate.\nThe 1939 Battersea Power Station by the river in the south-west is a local landmark, while some railway termini are excellent examples of Victorian architecture, most notably St. Pancras and Paddington. The density of London varies, with high employment density in the central area and Canary Wharf, high residential densities in inner London, and lower densities in Outer London.\n\nThe Monument in the City of London provides views of the surrounding area while commemorating the Great Fire of London, which originated nearby. Marble Arch and Wellington Arch, at the north and south ends of Park Lane, respectively, have royal connections, as do the Albert Memorial and Royal Albert Hall in Kensington. Nelson's Column (built to commemorate Admiral Horatio Nelson) is a nationally recognised monument in Trafalgar Square, one of the focal points of central London. Older buildings are mainly","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["114",{"pageContent":"brick built, most commonly the yellow London stock brick or a warm orange-red variety, often decorated with carvings and white plaster mouldings.\n\nIn the dense areas, most of the concentration is via medium- and high-rise buildings. London's skyscrapers, such as 30 St Mary Axe, Tower 42, the Broadgate Tower and One Canada Square, are mostly in the two financial districts, the City of London and Canary Wharf. High-rise development is restricted at certain sites if it would obstruct protected views of St Paul's Cathedral and other historic buildings. This protective policy, known as 'St Paul’s Heights', has been in operation by the City of London since 1937. Nevertheless, there are a number of tall skyscrapers in central London (see Tall buildings in London), including the 95-storey Shard London Bridge, the tallest building in the United Kingdom.\nOther notable modern buildings include The Scalpel, originally a nickname coined by the Financial Times due to its distinctive angular design but subsequently designated as its official name, 20 Fenchurch Street, dubbed \"The Walkie-Talkie\" because of its distinctive shape that resembles a two-way radio handset, the former City Hall in Southwark with","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["115",{"pageContent":"its distinctive oval shape, the Art Deco BBC Broadcasting House plus the Postmodernist British Library in Somers Town/Kings Cross and No 1 Poultry by James Stirling. What was formerly the Millennium Dome, by the Thames to the east of Canary Wharf, is now an entertainment venue called the O2 Arena.\n\n\n=== Cityscape ===\n\n\n=== Natural history ===\nThe London Natural History Society suggests that London is \"one of the World's Greenest Cities\" with more than 40 per cent green space or open water. They indicate that 2000 species of flowering plant have been found growing there and that the tidal Thames supports 120 species of fish. They also state that over 60 species of bird nest in central London and that their members have recorded 47 species of butterfly, 1173 moths and more than 270 kinds of spider around London. London's wetland areas support nationally important populations of many water birds. London has 38 Sites of Special Scientific Interest (SSSIs), two national nature reserves and 76 local nature reserves.Amphibians are common in the capital, including smooth newts living by the Tate Modern, and common frogs, common toads, palmate newts and great crested newts. On the other hand, native reptiles","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["116",{"pageContent":"such as slowworms, common lizards, barred grass snakes and adders, are mostly only seen in Outer London.\n\nAmong other inhabitants of London are 10,000 red foxes, so that there are now 16 foxes for every square mile (6 per square kilometre) of London. These urban foxes are noticeably bolder than their country cousins, sharing the pavement with pedestrians and raising cubs in people's backyards. Foxes have even sneaked into the Houses of Parliament, where one was found asleep on a filing cabinet. Another broke into the grounds of Buckingham Palace, reportedly killing some of Queen Elizabeth II's prized pink flamingos. Generally, however, foxes and city folk appear to get along. A survey in 2001 by the London-based Mammal Society found that 80 per cent of 3,779 respondents who volunteered to keep a diary of garden mammal visits liked having them around. This sample cannot be taken to represent Londoners as a whole.Other mammals found in Greater London are hedgehog, brown rat, mice, rabbit, shrew, vole, and grey squirrel. In wilder areas of Outer London, such as Epping Forest, a wide variety of mammals are found, including European hare, badger, field, bank and water vole, wood mouse, yellow-necked","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["117",{"pageContent":"mouse, mole, shrew, and weasel, in addition to red fox, grey squirrel and hedgehog. A dead otter was found at The Highway, in Wapping, about a mile from the Tower Bridge, which would suggest that they have begun to move back after being absent a hundred years from the city. Ten of England's eighteen species of bats have been recorded in Epping Forest: soprano, Nathusius' and common pipistrelles, common noctule, serotine, barbastelle, Daubenton's, brown long-eared, Natterer's and Leisler's.Among the strange sights in London have been a whale in the Thames, while the BBC Two programme Natural World: Unnatural History of London shows feral pigeons using the London Underground to get around the city, a seal that takes fish from fishmongers outside Billingsgate Fish Market, and foxes that will \"sit\" if given sausages.Herds of red and fallow deer also roam freely within much of Richmond and Bushy Park. A cull takes place each November and February to ensure numbers can be sustained. Epping Forest is also known for its fallow deer, which can frequently be seen in herds to the north of the Forest. A rare population of melanistic, black fallow deer is also maintained at the Deer Sanctuary near Theydon Bois.","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["118",{"pageContent":"Muntjac deer, which escaped from deer parks at the turn of the 20th century, are also found in the forest. While Londoners are accustomed to wildlife such as birds and foxes sharing the city, more recently urban deer have started becoming a regular feature, and whole herds of fallow deer come into residential areas at night to take advantage of London's green spaces.\n\n\n== Demography ==\n\nThe 2021 census recorded that 3,575,739 people or 40.6% of London's population were foreign-born making it the city with the second largest immigrant population after New York, in terms of absolute numbers. About 69% of children born in London in 2015 had at least one parent who was born abroad. The table to the right shows the commonest countries of birth of London residents. Note that some of the German-born population, in 18th position, are British citizens from birth born to parents serving in the British Armed Forces in Germany.Increasing industrialisation swelled London's population throughout the 19th and early 20th centuries, and for some time in the late 19th and early 20th centuries it was the most populous city in the world. It peaked at 8,615,245 in 1939, just before the outbreak of the Second World War, but had","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["119",{"pageContent":"declined to 7,192,091 by the 2001 Census. However, the population then grew by just over a million between the 2001 and 2011 Censuses, to reach 8,173,941 in the latter.However, London's continuous urban area extends beyond Greater London and numbered 9,787,426 people in 2011, while its wider metropolitan area had a population of 12–14 million, depending on the definition used. According to Eurostat, London is the second most populous metropolitan area in Europe. A net 726,000 immigrants arrived there in the period 1991–2001.The region covers 610 square miles (1,579 km2), giving a population density of 13,410 inhabitants per square mile (5,177/km2) more than ten times that of any other British region. In population terms, London is the 19th largest city and the 18th largest metropolitan region.\n\n\n=== Age structure and median age ===\nChildren younger than 14 constituted 20.6% of the population in Outer London in 2018, and 18% in Inner London. The 15–24 age group was 11.1% in Outer and 10.2% in Inner London, those aged 25–44 years 30.6% in Outer London and 39.7% in Inner London, those aged 45–64 years 24% and 20.7% in Outer and Inner London respectively. Those aged 65 and over are 13.6% in Outer London,","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["120",{"pageContent":"but only 9.3% in Inner London.The median age of London in 2018 was 36.5, which was younger than the UK median of 40.3.\n\n\n=== Ethnic groups ===\n\nAccording to the Office for National Statistics, based on 2011 Census estimates, 59.8 per cent of the 8,173,941 inhabitants of London were White, with 44.9% White British, 2.2% White Irish, 0.1% gypsy/Irish traveller and 12.1% classified as Other White. Meanwhile 20.9% of Londoners were of Asian and mixed-Asian descent, 19.7% being of full Asian descents and those of mixed-Asian heritage 1.2% of the population. Indians accounted for 6.6%, followed by Pakistanis and Bangladeshis at 2.7% each. Chinese peoples accounted for 1.5% and Arabs for 1.3%. A further 4.9% were classified as \"Other Asian\".15.6% of London's population were of Black and mixed-Black descent. 13.3% of full Black descent, with mixed-Black heritage comprising 2.3%. Black Africans accounted for 7.0% of London's population, with 4.2% as Black Caribbean and 2.1% as \"Other Black\". 5.0% were of mixed race. The history of African presence in London extends back to the Roman period.As of 2007, one fifth of primary school across London were from ethnic minorities. Altogether at the 2011 census, of","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["121",{"pageContent":"London's 1,624,768 population aged 0 to 15, 46.4% were White, 19.8% Asian, 19% Black, 10.8% Mixed and 4% another ethnic group. In January 2005, a survey of London's ethnic and religious diversity claimed that more than 300 languages were spoken in London and more than 50 non-indigenous communities had populations of more than 10,000. Figures from the Office for National Statistics show that in 2010, London's foreign-born population was 2,650,000 (33%), up from 1,630,000 in 1997.\nThe 2011 census showed that 36.7% of Greater London's population were born outside the UK. Some of the German-born population were likely to be British nationals born to parents serving in the British Armed Forces in Germany. Estimates by the Office for National Statistics indicate that the five largest foreign-born groups living in London in the period July 2009 to June 2010 were born in India, Poland, the Republic of Ireland, Bangladesh and Nigeria. In the 2021 census 40.6% of London residents were foreign-born. The ethnic demographics of the 2021 census were reported as 53.8% White, with White British reported at 36.8%, Asian or Asian British at  20.8%, Black or Black British , 13.5%, mixed 5.7% and other at 6.3%.\n\n\n===","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["122",{"pageContent":"Religion ===\n\nAccording to the 2011 Census, the largest religious groupings were Christians (48.4%), followed by those of no religion (20.7%), Muslims (12.4%), no response (8.5%), Hindus (5.0%), Jews (1.8%), Sikhs (1.5%), Buddhists (1.0%) and other (0.6%).London has traditionally been Christian, and has a large number of churches, particularly in the City of London. The well-known St Paul's Cathedral in the City and Southwark Cathedral south of the river are Anglican administrative centres, while the Archbishop of Canterbury, principal bishop of the Church of England and worldwide Anglican Communion, has his main residence at Lambeth Palace in the London Borough of Lambeth.\n\nImportant national and royal ceremonies are shared between St Paul's and Westminster Abbey. The Abbey is not to be confused with nearby Westminster Cathedral, the largest Roman Catholic cathedral in England and Wales. Despite the prevalence of Anglican churches, observance is low within the denomination. Anglican Church attendance continues a long, steady decline, according to Church of England statistics.Notable mosques include the East London Mosque in Tower Hamlets, which is allowed to give the Islamic","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["123",{"pageContent":"call to prayer through loudspeakers, the London Central Mosque on the edge of Regent's Park and the Baitul Futuh of the Ahmadiyya Muslim Community. After the oil boom, increasing numbers of wealthy Middle-Eastern Arab Muslims based themselves around Mayfair, Kensington and Knightsbridge in West London. There are large Bengali Muslim communities in the eastern boroughs of Tower Hamlets and Newham.Large Hindu communities are found in the north-western boroughs of Harrow and Brent, the latter hosting what was until 2006 Europe's largest Hindu temple, Neasden Temple. London is also home to 44 Hindu temples, including the BAPS Shri Swaminarayan Mandir London. There are Sikh communities in East and West London, particularly in Southall, home to one of the largest Sikh populations and the largest Sikh temple outside India.The majority of British Jews live in London, with notable Jewish communities in Stamford Hill, Stanmore, Golders Green, Finchley, Hampstead, Hendon and Edgware, all in North London. Bevis Marks Synagogue in the City of London is affiliated to London's historic Sephardic Jewish community. It is the only synagogue in Europe to have held regular services continually for over 300","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["124",{"pageContent":"years. Stanmore and Canons Park Synagogue has the largest membership of any Orthodox synagogue in Europe, overtaking Ilford synagogue (also in London) in 1998. The London Jewish Forum was set up in 2006 in response to the growing significance of devolved London Government.\n\n\n=== Accents ===\nCockney is an accent heard across London, mainly spoken by working-class and lower-middle class Londoners. It is mainly attributed to the East End and wider East London, having originated there in the 18th century, although it has been suggested that the Cockney style of speech is much older. Some features of Cockney include, Th-fronting (pronouncing \"th\" as \"f\"), example, \"some fings in life are bad\" (heard in opening of \"Always Look on the Bright Side of Life\" in Monty Python's Life of Brian), \"th\" inside a word is pronounced with a \"v\" (brother becomes bruvva), H-dropping, example 'Ampshire for Hampshire (as Eliza Doolittle said in My Fair Lady), and, like most English accents, a Cockney accent drops the \"r\" after a vowel, for example, \"car\" is pronounced \"cah\". John Camden Hotten, in his Slang Dictionary of 1859, makes reference to Cockney \"use of a peculiar slang language\" (Cockney rhyming slang) when","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["125",{"pageContent":"describing the costermongers of the East End. Examples include: using the word \"treacle\" to mean sweetheart (rhymes with Treacle tart), and \"porkies\" to mean lies (rhymes with Pork pies). Since the start of the 21st century the Cockney dialect is less common in parts of the East End itself, with modern strongholds including other parts of London and suburbs in the home counties.Estuary English is an intermediate accent between Cockney and Received Pronunciation. It is widely spoken by people of all classes in London and south-eastern England, associated with the River Thames and its estuary.Multicultural London English (MLE) is a multiethnolect becoming increasingly common in multicultural areas amongst young, working-class people from diverse backgrounds. It is a fusion of an array of ethnic accents, in particular Afro-Caribbean and South Asian, with a significant Cockney influence.Received Pronunciation (RP) is the accent traditionally regarded as the standard for British English. It has no specific geographical correlate, although it is also traditionally defined as the standard speech used in London and south-eastern England. It is mainly spoken by upper-class and upper-middle","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["126",{"pageContent":"class Londoners.\n\n\n== Economy ==\n\nLondon's gross regional product in 2019 was £503 billion, around a quarter of UK GDP. London has five major business districts: the city, Westminster, Canary Wharf, Camden & Islington and Lambeth & Southwark. One way to get an idea of their relative importance is to look at relative amounts of office space: Greater London had 27 million m2 of office space in 2001, and the City contains the most space, with 8 million m2 of office space. London has some of the highest real estate prices in the world. London is the world's most expensive office market according to world property journal (2015) report. As of 2015 the residential property in London is worth $2.2 trillion – the same value as that of Brazil's annual GDP. The city has the highest property prices of any European city according to the Office for National Statistics and the European Office of Statistics. On average the price per square metre in central London is €24,252 (April 2014). This is higher than the property prices in other G8 European capital cities; Berlin €3,306, Rome €6,188 and Paris €11,229.\n\n\n=== The City of London ===\n\nLondon's finance industry is based in the City of London and Canary Wharf, the two major","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["127",{"pageContent":"business districts in London. London is one of the pre-eminent financial centres of the world as the most important location for international finance. London took over as a major financial centre shortly after 1795 when the Dutch Republic collapsed before the Napoleonic armies. For many bankers established in Amsterdam (e.g. Hope, Baring), this was only time to move to London. Also, London's market-centred system (as opposed to the bank-centred one in Amsterdam) grew more dominant in the 18th century. The London financial elite was strengthened by a strong Jewish community from all over Europe capable of mastering the most sophisticated financial tools of the time. This unique concentration of talents accelerated the transition from the Commercial Revolution to the Industrial Revolution. Writing about capitalism and the utility of diversity in his book on English society, French philosopher Voltaire expounded upon why England at that time was more prosperous in comparison to the country's less religiously tolerant European neighbours:\n\nTake a view of the Royal Exchange in London, a place more venerable than many courts of justice, where the representatives of all nations meet for the","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["128",{"pageContent":"benefit of mankind. There the Jew, the Mahometan [Muslim], and the Christian transact together, as though they all professed the same religion, and give the name of infidel to none but bankrupts. There the Presbyterian confides in the Anabaptist, and the Churchman depends on the Quaker's word. If one religion only were allowed in England, the Government would very possibly become arbitrary; if there were but two, the people would cut one another's throats; but as there are such a multitude, they all live happy and in peace.\n\nBy the mid-19th century, London was the leading financial centre, and at the end of the century over half the world's trade was financed in British currency. Still, as of 2016 London tops the world rankings on the Global Financial Centres Index (GFCI), and it ranked second in A.T. Kearney's 2018 Global Cities Index.London's largest industry is finance, and its financial exports make it a large contributor to the UK's balance of payments. Around 325,000 people were employed in financial services in London until mid-2007. London has over 480 overseas banks, more than any other city in the world. It is also the world's biggest currency trading centre, accounting for some 37 per cent of","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["129",{"pageContent":"the $5.1 trillion average daily volume, according to the BIS. Over 85 per cent (3.2 million) of the employed population of greater London works in the services industries. Because of its prominent global role, London's economy had been affected by the financial crisis of 2007–2008. However, by 2010 the city had recovered, put in place new regulatory powers, proceeded to regain lost ground and re-established London's economic dominance. Along with professional services headquarters, the City of London is home to the Bank of England, London Stock Exchange, and Lloyd's of London insurance market.Over half the UK's top 100 listed companies (the FTSE 100) and over 100 of Europe's 500 largest companies have their headquarters in central London. Over 70 per cent of the FTSE 100 are within London's metropolitan area, and 75 per cent of Fortune 500 companies have offices in London. In a 1992 report commissioned by the London Stock Exchange, Sir Adrian Cadbury, chairman of his family's confectionery company Cadbury, produced the Cadbury Report, a code of best practice which served as a basis for reform of corporate governance around the world.\n\n\n=== Media and technology ===\n\nMedia companies are","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["130",{"pageContent":"concentrated in London, and the media distribution industry is London's second most competitive sector. The BBC is a significant employer, while other broadcasters also have headquarters around the city. Many national newspapers are edited in London; the term Fleet Street (where most national newspapers operated) remains a metonym for the British national press. London is a major retail centre and in 2010 had the highest non-food retail sales of any city in the world, with a total spend of around £64.2 billion. The Port of London is the second largest in the UK, handling 45 million tonnes of cargo each year.A growing number of technology companies are based in London, notably in East London Tech City, also known as Silicon Roundabout. In 2014 the city was among the first to receive a geoTLD. In February 2014 London was ranked as the European City of the Future in the 2014/15 list by fDi Intelligence. Computer science pioneer Alan Turing hails from Maida Vale, west London. A museum in Bletchley Park, where Turing was based during World War II, is in Bletchley, 40 miles (64 km) north of central London, as is The National Museum of Computing.The gas and electricity distribution networks that manage and operate","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["131",{"pageContent":"the towers, cables and pressure systems that deliver energy to consumers across the city are managed by National Grid plc, SGN and UK Power Networks.\n\n\n=== Tourism ===\n\nLondon is one of the leading tourist destinations in the world and in 2015 was ranked as the most visited city in the world with over 65 million visits. It is also the top city in the world by visitor cross-border spending, estimated at US$20.23 billion in 2015. Tourism is one of London's prime industries, employing 700,000 full-time workers in 2016, and contributes £36 billion a year to the economy. The city accounts for 54% of all inbound visitor spending in the UK. As of 2016 London was the world top city destination as ranked by TripAdvisor users.In 2015 the top most-visited attractions in the UK were all in London. The top 10 most visited attractions were: (with visits per venue)\nBritish Museum: 6,820,686\nNational Gallery: 5,908,254\nNatural History Museum (South Kensington): 5,284,023\nSouthbank Centre: 5,102,883\nTate Modern: 4,712,581\nVictoria and Albert Museum (South Kensington): 3,432,325\nScience Museum: 3,356,212\nSomerset House: 3,235,104\nTower of London: 2,785,249\nNational Portrait Gallery: 2,145,486The","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["132",{"pageContent":"number of hotel rooms in London in 2015 stood at 138,769, and is expected to grow over the years.\n\n\n== Transport ==\n\nTransport is one of the four main areas of policy administered by the Mayor of London, but the mayor's financial control does not extend to the longer-distance rail network that enters London. In 2007 the Mayor of London assumed responsibility for some local lines, which now form the London Overground network, adding to the existing responsibility for the London Underground, trams and buses. The public transport network is administered by Transport for London (TfL).The lines that formed the London Underground, as well as trams and buses, became part of an integrated transport system in 1933 when the London Passenger Transport Board or London Transport was created. Transport for London is now the statutory corporation responsible for most aspects of the transport system in Greater London, and is run by a board and a commissioner appointed by the Mayor of London.\n\n\n=== Aviation ===\n\nLondon is a major international air transport hub with the busiest city airspace in the world. Eight airports use the word London in their name, but most traffic passes through six of these. Additionally,","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["133",{"pageContent":"various other airports also serve London, catering primarily to general aviation flights.\n\nHeathrow Airport, in Hillingdon, West London, was for many years the busiest airport in the world for international traffic, and is the major hub of the nation's flag carrier, British Airways. In March 2008 its fifth terminal was opened. In 2014, Dubai gained from Heathrow the leading position in terms of international passenger traffic.\nGatwick Airport, south of London in West Sussex, handles flights to more destinations than any other UK airport and is the main base of easyJet, the UK's largest airline by number of passengers.\nStansted Airport, north-east of London in Essex, has flights that serve the greatest number of European destinations of any UK airport and is the main base of Ryanair, the world's largest international airline by number of international passengers.\nLuton Airport, to the north of London in Bedfordshire, is used by several budget airlines (especially easyJet and Wizz Air) for short-haul flights.\nLondon City Airport, the most central airport and the one with the shortest runway, in Newham, East London, is focused on business travellers, with a mixture of full-service","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["134",{"pageContent":"short-haul scheduled flights and considerable business jet traffic.\nSouthend Airport, east of London in Essex, is a smaller, regional airport that caters for short-haul flights on a limited, though growing, number of airlines. In 2017, international passengers made up over 95% of the total at Southend, the highest proportion of any London airport.\n\n\n=== Rail ===\n\n\n==== Underground and DLR ====\n\nOpened in 1863, the London Underground, commonly referred to as the Tube or just the Underground, is the oldest and third longest metro system in the world. The system serves 272 stations. and was formed from several private companies, including the world's first underground electric line, the City and South London Railway, which opened in 1890.Over four million journeys are made every day on the Underground network, over 1 billion each year. An investment programme is attempting to reduce congestion and improve reliability, including £6.5 billion (€7.7 billion) spent before the 2012 Summer Olympics. The Docklands Light Railway (DLR), which opened in 1987, is a second, more local metro system using smaller and lighter tram-type vehicles that serve the Docklands, Greenwich and Lewisham.\n\n\n====","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["135",{"pageContent":"Suburban ====\nThere are 368 railway stations in the London Travelcard Zones on an extensive above-ground suburban railway network. South London, particularly, has a high concentration of railways as it has fewer Underground lines. Most rail lines terminate around the centre of London, running into eighteen terminal stations, with the exception of the Thameslink trains connecting Bedford in the north and Brighton in the south via Luton and Gatwick airports. London has Britain's busiest station by number of passengers—Waterloo, with over 184 million people using the interchange station complex (which includes Waterloo East station) each year. Clapham Junction is the busiest station in Europe by the number of trains passing.\nWith the need for more rail capacity in London, the Elizabeth Line (also known as Crossrail) opened in May 2022. It is a new railway line running east to west through London and into the Home Counties with a branch to Heathrow Airport. It was Europe's biggest construction project, with a £15 billion projected cost.\n\n\n==== Inter-city and international ====\n\nLondon is the centre of the National Rail network, with 70 per cent of rail journeys starting or ending in London.","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["136",{"pageContent":"King's Cross station and Euston station, which are both in London, are the starting points of the East Coast Main Line and the West Coast Main Line – the two main railway lines in Britain. Like suburban rail services, regional and inter-city trains depart from several termini around the city centre, directly linking London with most of Great Britain's major cities and towns.Some international railway services to Continental Europe were operated during the 20th century as boat trains, such as the Admiraal de Ruijter to Amsterdam and the Night Ferry to Paris and Brussels. The opening of the Channel Tunnel in 1994 connected London directly to the continental rail network, allowing Eurostar services to begin. Since 2007, high-speed trains link St. Pancras International with Lille, Calais, Paris, Disneyland Paris, Brussels, Amsterdam and other European tourist destinations via the High Speed 1 rail link and the Channel Tunnel. The first high-speed domestic trains started in June 2009 linking Kent to London. There are plans for a second high speed line linking London to the Midlands, North West England, and Yorkshire.\n\n\n==== Freight ====\nAlthough rail freight levels are far down compared to their","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["137",{"pageContent":"height, significant quantities of cargo are also carried into and out of London by rail; chiefly building materials and landfill waste. As a major hub of the British railway network, London's tracks also carry large amounts of freight for the other regions, such as container freight from the Channel Tunnel and English Channel ports, and nuclear waste for reprocessing at Sellafield.\n\n\n=== Buses, coaches and trams ===\n\nLondon's bus network runs 24 hours a day with about 9,300 vehicles, over 675 bus routes and about 19,000 bus stops. In 2019 the network had over 2 billion commuter trips per year. Since 2010 an average of £1.2 billion is taken in revenue each year. London has one of the largest wheelchair-accessible networks in the world and from the third quarter of 2007, became more accessible to hearing and visually impaired passengers as audio-visual announcements were introduced.London's coach hub is Victoria Coach Station, an Art Deco building opened in 1932. The coach station was initially run by a group of coach companies under the name of London Coastal Coaches; however, in 1970 the service and station were included in the nationalisation of the country's coach services, becoming part of the","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["138",{"pageContent":"National Bus Company. In 1988, the coach station was purchased by London Transport which then became Transport for London. Victoria Coach Station has over 14 million passengers a year and provides services across the UK and continental Europe.London has a modern tram network, known as Tramlink, centred on Croydon in South London. The network has 39 stops and four routes, and carried 28 million people in 2013. Since June 2008, Transport for London has completely owned and operated Tramlink.\n\n\n=== Cable car ===\nLondon's first and to date only cable car is the London Cable Car, which opened in June 2012. The cable car crosses the Thames and links Greenwich Peninsula with the Royal Docks in the east of the city. It is integrated with London's Oyster Card ticketing system, although the Emirates Air Line fares are not included in the Oyster daily capping. It cost £60 million to build and can carry up to 2,500 passengers per hour in each direction at peak times. Similar to the London Cycle Hire Scheme bike hire scheme, the cable car was sponsored in a 10-year deal by the airline Emirates.\n\n\n=== Cycling ===\n\nIn the Greater London Area, around 670,000 people use a bike every day, meaning around 7% of the total","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["139",{"pageContent":"population of around 8.8 million use a bike on an average day. This relatively low percentage of bicycle users may be due to the poor investments for cycling in London of about £110 million per year, equating to around £12 per person, which can be compared to £22 in the Netherlands.Cycling has become an increasingly popular way to get around London. The launch of a bicycle hire scheme in July 2010 was successful and generally well received.\n\n\n=== Port and river boats ===\nThe Port of London, once the largest in the world, is now only the second-largest in the United Kingdom, handling 45 million tonnes of cargo each year as of 2009. Most of this cargo passes through the Port of Tilbury, outside the boundary of Greater London.London has river boat services on the Thames known as Thames Clippers, which offer both commuter and tourist boat services. At major piers including Canary Wharf, London Bridge City, Battersea Power Station and London Eye (Waterloo), services depart at least every 20 minutes during commuter times. The Woolwich Ferry, with 2.5 million passengers every year, is a frequent service linking the North and South Circular Roads.\n\n\n=== Roads ===\nAlthough the majority of journeys in central","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["140",{"pageContent":"London are made by public transport, car travel is common in the suburbs. The inner ring road (around the city centre), the North and South Circular roads (just within the suburbs), and the outer orbital motorway (the M25, just outside the built-up area in most places) encircle the city and are intersected by a number of busy radial routes—but very few motorways penetrate into inner London. A plan for a comprehensive network of motorways throughout the city (the Ringways Plan) was prepared in the 1960s but was mostly cancelled in the early 1970s. The M25 is the second-longest ring-road motorway in Europe at 117 miles (188 km) long. The A1 and M1 connect London to Leeds, and Newcastle and Edinburgh.\n\nThe Austin Motor Company began making hackney carriages (London taxis) in 1929, and models include Austin FX3 from 1948, Austin FX4 from 1958, with more recent models TXII and TX4 manufactured by London Taxis International. The BBC states, \"ubiquitous black cabs and red double-decker buses all have long and tangled stories that are deeply embedded in London’s traditions\".London is notorious for its traffic congestion; in 2009, the average speed of a car in the rush hour was recorded at 10.6 mph (17.1 km/h). In","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["141",{"pageContent":"2003, a congestion charge was introduced to reduce traffic volumes in the city centre. With a few exceptions, motorists are required to pay to drive within a defined zone encompassing much of central London. Motorists who are residents of the defined zone can buy a greatly reduced season pass. The London government initially expected the Congestion Charge Zone to increase daily peak period Underground and bus users, reduce road traffic, increase traffic speeds, and reduce queues; however, the increase in private for hire vehicles has affected these expectations. Over the course of several years, the average number of cars entering the centre of London on a weekday was reduced from 195,000 to 125,000 cars – a 35-per-cent reduction of vehicles driven per day.\n\n\n== Education ==\n\n\n=== Tertiary education ===\n\nLondon is a major global centre of higher education teaching and research and has the largest concentration of higher education institutes in Europe. According to the QS World University Rankings 2015/16, London has the greatest concentration of top class universities in the world and its international student population of around 110,000 is larger than any other city in the world. A 2014","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["142",{"pageContent":"PricewaterhouseCoopers report termed London the global capital of higher education.\n\nA number of world-leading education institutions are based in London. In the 2022 QS World University Rankings, Imperial College London is ranked No. 6 in the world, University College London (UCL) is ranked 8th, and King's College London (KCL) is ranked 37th. All are regularly ranked highly, with Imperial College being the UK's leading university in the Research Excellence Framework ranking 2021. The London School of Economics has been described as the world's leading social science institution for both teaching and research. The London Business School is considered one of the world's leading business schools and in 2015 its MBA programme was ranked second-best in the world by the Financial Times. The city is also home to three of the world's top ten performing arts schools (as ranked by the 2020 QS World University Rankings): the Royal College of Music (ranking 2nd in the world), the Royal Academy of Music (ranking 4th) and the Guildhall School of Music and Drama (ranking 6th).With students in London and around 48,000 in University of London Worldwide, the federal University of London is the largest contact","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["143",{"pageContent":"teaching university in the UK. It includes five multi-faculty universities – City, King's College London, Queen Mary, Royal Holloway and UCL – and a number of smaller and more specialised institutions including Birkbeck, the Courtauld Institute of Art, Goldsmiths, the London Business School, the London School of Economics, the London School of Hygiene & Tropical Medicine, the Royal Academy of Music, the Central School of Speech and Drama, the Royal Veterinary College and the School of Oriental and African Studies. Members of the University of London have their own admissions procedures, and most award their own degrees.\n\nA number of universities in London are outside the University of London system, including Brunel University, Imperial College London, Kingston University, London Metropolitan University, University of East London, University of West London, University of Westminster, London South Bank University, Middlesex University, and University of the Arts London (the largest university of art, design, fashion, communication and the performing arts in Europe). In addition, there are three international universities in London – Regent's University London, Richmond, The","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["144",{"pageContent":"American International University in London and Schiller International University.\nLondon is home to five major medical schools – Barts and The London School of Medicine and Dentistry (part of Queen Mary), King's College London School of Medicine (the largest medical school in Europe), Imperial College School of Medicine, UCL Medical School and St George's, University of London – and has many affiliated teaching hospitals. It is also a major centre for biomedical research, and three of the UK's eight academic health science centres are based in the city – Imperial College Healthcare, King's Health Partners and UCL Partners (the largest such centre in Europe). Additionally, many biomedical and biotechnology spin out companies from these research institutions are based around the city, most prominently in White City. Founded by pioneering nurse Florence Nightingale at St Thomas' Hospital in 1860, the first nursing school is now part of King's College London. There are a number of business schools in London, including the London School of Business and Finance, Cass Business School (part of City University London), Hult International Business School, ESCP Europe, European Business School","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["145",{"pageContent":"London, Imperial College Business School, the London Business School and the UCL School of Management. \nLondon is also home to many specialist arts education institutions, including the Central School of Ballet, London Academy of Music and Dramatic Art (LAMDA; president Benedict Cumberbatch), London College of Contemporary Arts (LCCA), London Contemporary Dance School, National Centre for Circus Arts, Royal Academy of Dramatic Art (RADA; president Sir Kenneth Branagh), Rambert School of Ballet and Contemporary Dance, the Royal College of Art, Sylvia Young Theatre School and Trinity Laban. \nThe BRIT School in the London borough of Croydon provides training for the performing arts and the technologies that make performance possible, with actor Tom Holland among their alumni.\n\n\n=== Primary and secondary education ===\nThe majority of primary and secondary schools and further-education colleges in London are controlled by the London boroughs or otherwise state-funded; leading examples include Ashbourne College, Bethnal Green Academy, Brampton Manor Academy, City and Islington College, City of Westminster College, David Game College, Ealing, Hammersmith and West London College,","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["146",{"pageContent":"Leyton Sixth Form College, London Academy of Excellence, Tower Hamlets College, and Newham Collegiate Sixth Form Centre. There are also a number of private schools and colleges in London, some old and famous, such as City of London School, Harrow, St Paul's School, Haberdashers' Aske's Boys' School, University College School, The John Lyon School, Highgate School and Westminster School.\n\n\n=== Societies ===\nImportant scientific learned societies based in London include the Royal Society—the UK's national academy of sciences and the oldest national scientific institution in the world—founded in 1660, and the Royal Institution, founded in 1799; the basement of the latter is where Michael Faraday first demonstrated electric motion in 1821. Since 1825, the Royal Institution Christmas Lectures have presented scientific subjects to a general audience, and speakers have included aerospace engineer Frank Whittle, naturalist David Attenborough and evolutionary biologist Richard Dawkins.\n\n\n== Culture ==\n\n\n=== Leisure and entertainment ===\n\nLeisure is a major part of the London economy. A 2003 report attributed a quarter of the entire UK leisure economy to London at 25.6 events per 1000","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["147",{"pageContent":"people. The city is one of the four fashion capitals of the world, and, according to official statistics, is the world's third-busiest film production centre, presents more live comedy than any other city, and has the biggest theatre audience of any city in the world.\n\nWithin the City of Westminster in London, the entertainment district of the West End has its focus around Leicester Square, where London and world film premieres are held, and Piccadilly Circus, with its giant electronic advertisements. London's theatre district is here, as are many cinemas, bars, clubs, and restaurants, including the city's Chinatown district (in Soho), and just to the east is Covent Garden, an area housing speciality shops. The city is the home of Andrew Lloyd Webber, whose musicals have dominated West End theatre since the late 20th century.  Agatha Christie's The Mousetrap, the world's longest-running play, has been performed in the West End since 1952. The Laurence Olivier Awards–named after Laurence Olivier–are given annually by the Society of London Theatre. The Royal Ballet, English National Ballet, Royal Opera, and English National Opera are based in London and perform at the Royal Opera House, the London","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["148",{"pageContent":"Coliseum, Sadler's Wells Theatre, and the Royal Albert Hall, as well as touring the country.\n\nIslington's 1 mile (1.6 km) long Upper Street, extending northwards from Angel, has more bars and restaurants than any other street in the UK. Europe's busiest shopping area is Oxford Street, a shopping street nearly 1 mile (1.6 km) long, making it the longest shopping street in the UK. It is home to vast numbers of retailers and department stores, including Selfridges flagship store. Knightsbridge, home to the equally renowned Harrods department store, lies to the south-west. Opened in 1760 with its flagship store on Regent Street since 1881, Hamleys is the oldest toy store in the world. Madame Tussauds wax museum opened in Baker Street in 1835.London is home to designers John Galliano, Stella McCartney, Manolo Blahnik, and Jimmy Choo, among others; its renowned art and fashion schools make it one of the four international centres of fashion. Mary Quant designed the miniskirt in her King's Road boutique in Swinging Sixties London. London offers a great variety of cuisine as a result of its ethnically diverse population. Gastronomic centres include the Bangladeshi restaurants of Brick Lane and the Chinese","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["149",{"pageContent":"restaurants of Chinatown. There are Chinese takeaways throughout London, as are Indian restaurants which provide Indian and Anglo-Indian cuisine. Around 1860, the first fish and chips shop in London was opened by Joseph Malin, a Jewish immigrant, in Bow. The full English breakfast dates from the Victorian era, and many cafe's in London serve a full English throughout the day. London has five 3-Michelin star restaurants, including Restaurant Gordon Ramsay in Chelsea. Many hotels in London provide a traditional afternoon tea service, such as the Oscar Wilde Lounge at the Hotel Café Royal in Piccadilly, and a themed tea service is also available, for example an Alice in Wonderland themed afternoon tea served at the Egerton House Hotel, and Charlie and the Chocolate Factory themed afternoon tea at One Aldwych in Covent Garden. The nation's most popular biscuit to dunk in tea, chocolate digestives have been manufactured by McVitie's at their Harlesden factory in north-west London since 1925.\n\nThere is a variety of annual events, beginning with the relatively new New Year's Day Parade, a fireworks display at the London Eye; the world's second largest street party, the Notting Hill Carnival, is held on","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["150",{"pageContent":"the late August Bank Holiday each year. Traditional parades include November's Lord Mayor's Show, a centuries-old event celebrating the annual appointment of a new Lord Mayor of the City of London with a procession along the streets of the city, and June's Trooping the Colour, a formal military pageant performed by regiments of the Commonwealth and British armies to celebrate the Queen's Official Birthday. The Boishakhi Mela is a Bengali New Year festival celebrated by the British Bangladeshi community. It is the largest open-air Asian festival in Europe. After the Notting Hill Carnival, it is the second-largest street festival in the United Kingdom attracting over 80,000 visitors from across the country. First held in 1862, the RHS Chelsea Flower Show (run by the Royal Horticultural Society) takes place over five days in May every year.\n\n\n=== LGBT scene ===\n\nThe first gay bar in London in the modern sense was The Cave of the Golden Calf, established as a night club in an underground location at 9 Heddon Street, just off Regent Street, in 1912 and became a haunt for the wealthy, aristocratic and bohemian. While London has been an LGBT tourism destination, after homosexuality was decriminalised in","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["151",{"pageContent":"England in 1967 gay bar culture became more visible, and from the early 1970s Soho (and in particular Old Compton Street) became the centre of the London LGBT community. G-A-Y, previously based at the Astoria, and now Heaven, is a long-running night club.Wider British cultural movements have also influenced LGBT culture: for example, the emergence of glam rock in the UK in the early 1970s, via Marc Bolan and David Bowie, saw a generation of teenagers begin playing with the idea of androgyny, and the West End musical The Rocky Horror Show, which debuted in London in 1973, is also widely said to have been an influence on countercultural and sexual liberation movements. The Blitz Kids (which included Boy George) frequented the Tuesday club-night at Blitz in Covent Garden, helping launch the New Romantic subcultural movement in the late 1970s. Today, the annual London Pride Parade and the London Lesbian and Gay Film Festival are held in the city.\n\n\n=== Literature, film and television ===\n\nLondon has been the setting for many works of literature. The pilgrims in Geoffrey Chaucer's late 14th-century Canterbury Tales set out for Canterbury from London—specifically, from the Tabard inn, Southwark. William","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["152",{"pageContent":"Shakespeare spent a large part of his life living and working in London; his contemporary Ben Jonson was also based there, and some of his work, most notably his play The Alchemist, was set in the city. A Journal of the Plague Year (1722) by Daniel Defoe is a fictionalisation of the events of the 1665 Great Plague.The literary centres of London have traditionally been hilly Hampstead and (since the early 20th century) Bloomsbury. Writers closely associated with the city are the diarist Samuel Pepys, noted for his eyewitness account of the Great Fire; Charles Dickens, whose representation of a foggy, snowy, grimy London of street sweepers and pickpockets has been a major influence on people's vision of early Victorian London; and Virginia Woolf, regarded as one of the foremost modernist literary figures of the 20th century. Later important depictions of London from the 19th and early 20th centuries are Arthur Conan Doyle's Sherlock Holmes stories. In 1898, H. G. Wells' sci-fi novel The War of the Worlds sees London (and the south of England) invaded by Martians. Also of significance is Letitia Elizabeth Landon's Calendar of the London Seasons (1834). Modern writers pervasively influenced by the city","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["153",{"pageContent":"include Peter Ackroyd, author of a \"biography\" of London, and Iain Sinclair, who writes in the genre of psychogeography. In the 1940s, George Orwell wrote essays in the London Evening Standard, most notably \"A Nice Cup of Tea\", which concerned the nation's methods on making tea, and \"The Moon Under Water\", which provided a detailed description of his ideal pub. In 1958, author Michael Bond created Paddington Bear, a refugee found in London Paddington station by the Brown family who adopt him. Paddington has been adapted for the screen, including Paddington (2014) which features the calypso song \"London is the Place for Me\".\n\nLondon has played a significant role in the film industry. Major studios within or bordering London include Pinewood, Elstree, Ealing, Shepperton, Twickenham, and Leavesden, with the James Bond and Harry Potter series among many notable films produced here. Working Title Films has its headquarters in London. A post-production community is centred in Soho, and London houses six of the world’s largest visual effects companies, such as Framestore. The Imaginarium, a digital performance-capture studio, was founded by Andy Serkis. London has been the setting for films","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["154",{"pageContent":"including Oliver Twist (1948), Scrooge (1951), Peter Pan (1953), The 101 Dalmatians (1961), My Fair Lady (1964), Mary Poppins (1964), Blowup (1966), A Clockwork Orange (1971), The Long Good Friday (1980), The Great Mouse Detective (1986), Notting Hill (1999), Love Actually (2003), V for Vendetta (2005), Sweeney Todd: The Demon Barber of Fleet Street (2008) and The King's Speech (2010). Notable actors and filmmakers from London include; Charlie Chaplin, Alfred Hitchcock, Michael Caine, Emma Thompson, Gary Oldman, Guy Ritchie, Christopher Nolan, Alan Rickman, Jude Law, Helena Bonham Carter, Idris Elba, Tom Hardy, Keira Knightley and Daniel Day-Lewis. Ealing comedies have featured Alec Guinness, Hammer Horrors have starred Christopher Lee, while Richard Curtis's rom-coms have featured Hugh Grant. The largest cinema chain in the country, Odeon Cinemas was founded in London in 1928 by Oscar Deutsch. First held in 1949, since 2017 the British Academy Film Awards (BAFTAs) have taken place at the Royal Albert Hall. Founded in 1957, the BFI London Film Festival takes place over two weeks every October.London is a major centre for television production, with studios including Television Centre,","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["155",{"pageContent":"ITV Studios, Sky Campus and Fountain Studios; the latter hosted the original talent shows, Pop Idol, The X Factor, and Britain's Got Talent, before each format was exported around the world. Formerly a franchise of ITV, Thames Television featured comedians such as Benny Hill and Rowan Atkinson (Mr. Bean was first screened by Thames), while Talkback produced Da Ali G Show which featured Sacha Baron Cohen as Ali G, a faux-streetwise gangster from Staines, west of London. Many television shows have been set in London, including the popular television soap opera EastEnders, broadcast by the BBC since 1985.\n\n\n=== Museums, art galleries and libraries ===\n\nLondon is home to many museums, galleries, and other institutions, many of which are free of admission charges and are major tourist attractions as well as playing a research role. The first of these to be established was the British Museum in Bloomsbury, in 1753. Originally containing antiquities, natural history specimens, and the national library, the museum now has 7 million artefacts from around the globe. In 1824, the National Gallery was founded to house the British national collection of Western paintings; this now occupies a prominent","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["156",{"pageContent":"position in Trafalgar Square.The British Library is the second largest library in the world, and the national library of the United Kingdom. There are many other research libraries, including the Wellcome Library and Dana Centre, as well as university libraries, including the British Library of Political and Economic Science at LSE, the Central Library at Imperial, the Maughan Library at King's, and the Senate House Libraries at the University of London.In the latter half of the 19th century the locale of South Kensington was developed as \"Albertopolis\", a cultural and scientific quarter. Three major national museums are there: the Victoria and Albert Museum (for the applied arts), the Natural History Museum, and the Science Museum. The National Portrait Gallery was founded in 1856 to house depictions of figures from British history; its holdings now comprise the world's most extensive collection of portraits. The national gallery of British art is at Tate Britain, originally established as an annexe of the National Gallery in 1897. The Tate Gallery, as it was formerly known, also became a major centre for modern art. In 2000, this collection moved to Tate Modern, a new gallery housed in the","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["157",{"pageContent":"former Bankside Power Station which is accessed by pedestrians north of the Thames via the Millennium Bridge.\n\n\n=== Music ===\n\nLondon is one of the major classical and popular music capitals of the world and hosts major music corporations, such as Universal Music Group International and Warner Music Group, and countless bands, musicians and industry professionals. The city is also home to many orchestras and concert halls, such as the Barbican Arts Centre (principal base of the London Symphony Orchestra and the London Symphony Chorus), the Southbank Centre (London Philharmonic Orchestra and the Philharmonia Orchestra), Cadogan Hall (Royal Philharmonic Orchestra) and the Royal Albert Hall (The Proms). The Proms, an eight-week summer season of daily orchestral classical music first held in 1895, ends with the Last Night of the Proms (works by Edward Elgar, Henry Wood, Thomas Arne and Hubert Parry feature at the climax). London's two main opera houses are the Royal Opera House and the London Coliseum (home to the English National Opera). The UK's largest pipe organ is at the Royal Albert Hall. Other significant instruments are in cathedrals and major churches—the church bells of St Clement Danes","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["158",{"pageContent":"feature in the 1744 nursery rhyme \"Oranges and Lemons\", and the lyrics journey through churches and bells of 18th century London. Several conservatoires are within the city: Royal Academy of Music, Royal College of Music, Guildhall School of Music and Drama and Trinity Laban.\n\nLondon has numerous venues for rock and pop concerts, including the world's busiest indoor venue, the O2 Arena, and Wembley Arena, as well as many mid-sized venues, such as Brixton Academy, the Hammersmith Apollo and the Shepherd's Bush Empire. Several music festivals, including the Wireless Festival, Lovebox and Hyde Park's British Summer Time, are held in London.The city is home to the original Hard Rock Cafe and the Abbey Road Studios, where The Beatles recorded many of their hits. In the 1960s, 1970s and 1980s, musicians and groups like Elton John, Pink Floyd, David Bowie, Queen, The Kinks, Cliff Richard, The Rolling Stones, The Who, Eric Clapton, Led Zeppelin, Iron Maiden, T. Rex, Fleetwood Mac, Elvis Costello, Dire Straits, Cat Stevens, The Police, The Cure, Madness, Culture Club, Dusty Springfield, Phil Collins, Rod Stewart, Status Quo and Sade, derived their sound from the streets and rhythms of London.London was","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["159",{"pageContent":"instrumental in the development of punk music, with figures such as the Sex Pistols, The Clash and fashion designer Vivienne Westwood all based in the city. Other artists to emerge from the London music scene include George Michael, Kate Bush, Seal, the Pet Shop Boys, Siouxsie and the Banshees, Bush, the Spice Girls, Jamiroquai, Blur, The Prodigy, Gorillaz, Mumford & Sons, Coldplay, Amy Winehouse, Adele, Sam Smith, Ed Sheeran, Ellie Goulding, Dua Lipa and Florence and the Machine. Artists from London with a Caribbean influence include Hot Chocolate, Billy Ocean, Soul II Soul and Eddy Grant, with the latter fusing reggae, soul and samba with rock and pop. London is also a centre for urban music. In particular the genres UK garage, drum and bass, dubstep and grime evolved in the city from the foreign genres of house, hip hop, and reggae, alongside local drum and bass. Music station BBC Radio 1Xtra was set up to support the rise of local urban contemporary music both in London and in the rest of the United Kingdom. The British Phonographic Industry's annual popular music awards, the Brit Awards, are held in London, usually in February.\n\n\n== Recreation ==\n\n\n=== Parks and open spaces ===\n\nA 2013 report by the","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["160",{"pageContent":"City of London Corporation said that London is the \"greenest city\" in Europe with 14,164 hectares (35,000 acres) of public parks, woodlands and gardens. The largest parks in the central area of London are three of the eight Royal Parks, namely Hyde Park and its neighbour Kensington Gardens in the west, and Regent's Park to the north. Hyde Park in particular is popular for sports and sometimes hosts open-air concerts. Regent's Park contains London Zoo, the world's oldest scientific zoo, and is near Madame Tussauds Wax Museum. Primrose Hill, immediately to the north of Regent's Park, at 256 feet (78 m) is a popular spot from which to view the city skyline.\nClose to Hyde Park are smaller Royal Parks, Green Park and St. James's Park. A number of large parks lie outside the city centre, including Hampstead Heath and the remaining Royal Parks of Greenwich Park to the southeast and Bushy Park and Richmond Park (the largest) to the southwest, Hampton Court Park is also a royal park, but, because it contains a palace, it is administered by the Historic Royal Palaces, unlike the eight Royal Parks.Close to Richmond Park is Kew Gardens, which has the world's largest collection of living plants. In 2003, the gardens were","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["161",{"pageContent":"put on the UNESCO list of World Heritage Sites. There are also parks administered by London's borough Councils, including Victoria Park in the East End and Battersea Park in the centre. Some more informal, semi-natural open spaces also exist, including the 320-hectare (790-acre) Hampstead Heath of North London, and Epping Forest, which covers 2,476 hectares (6,118 acres) in the east. Both are controlled by the City of London Corporation. Hampstead Heath incorporates Kenwood House, a former stately home and a popular location in the summer months when classical musical concerts are held by the lake, attracting thousands of people every weekend to enjoy the music, scenery and fireworks. Epping Forest is a popular venue for various outdoor activities, including mountain biking, walking, horse riding, golf, angling, and orienteering.\n\n\n=== Walking ===\n\nWalking is a popular recreational activity in London. Areas that provide for walks include Wimbledon Common, Epping Forest, Hampton Court Park, Hampstead Heath, the eight Royal Parks, canals and disused railway tracks. Access to canals and rivers has improved recently, including the creation of the Thames Path, some 28 miles (45 km) of which","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["162",{"pageContent":"is within Greater London, and The Wandle Trail; this runs 12 miles (19 km) through South London along the River Wandle, a tributary of the River Thames.Other long-distance paths, linking green spaces, have also been created, including the Capital Ring, the Green Chain Walk, London Outer Orbital Path (\"Loop\"), Jubilee Walkway, Lea Valley Walk, and the Diana, Princess of Wales Memorial Walk.\n\n\n== Sport ==\n\nLondon has hosted the Summer Olympics three times: in 1908, 1948, and 2012, making it the first city to host the modern Games three times. The city was also the host of the British Empire Games in 1934. In 2017, London hosted the World Championships in Athletics for the first time.London's most popular sport is football, and it has seven clubs in the Premier League in the 2022–23 season: Arsenal, Brentford, Chelsea, Crystal Palace, Fulham, Tottenham Hotspur, and West Ham United. Other professional men's teams in London are AFC Wimbledon, Barnet, Bromley, Charlton Athletic, Dagenham & Redbridge, Leyton Orient, Millwall, Queens Park Rangers and Sutton United. Four London-based teams are in the Women's Super League: Arsenal, Chelsea, Tottenham and West Ham United.\nFrom 1924, the original Wembley","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["163",{"pageContent":"Stadium was the home of the English national football team. It hosted the 1966 FIFA World Cup Final, with England defeating West Germany, and served as the venue for the FA Cup Final as well as rugby league's Challenge Cup final. The new Wembley Stadium serves the same purposes and has a capacity of 90,000. The women's team defeated Germany at Wembley to win Euro 2022.Three Premiership Rugby union teams are based in London, Harlequins, London Irish and Saracens. Ealing Trailfinders, London Sottish and Richmond play in the RFU Championship; other rugby union clubs in the city include Scottish, Rosslyn Park F.C., Westcombe Park R.F.C. and Blackheath F.C. Twickenham Stadium in south-west London hosts home matches for the England national rugby union team and has a capacity of 82,000 now that the new south stand has been completed.While rugby league is more popular in the north of England, there are two professional rugby league clubs in London – the London Broncos in the second-tier RFL Championship, who play at the Trailfinders Sports Ground in West Ealing, and the third-tier League 1 team, the London Skolars from Wood Green, Haringey.\nOne of London's best-known annual sports competitions is the","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["164",{"pageContent":"Wimbledon Tennis Championships, held at the All England Club in the south-western suburb of Wimbledon since 1877. Played in late June to early July, it is the oldest tennis tournament in the world and widely considered the most prestigious. Founded in London in 1881, Slazenger has provided tennis balls for Wimbledon since 1902, the oldest sponsorship in sport.London has two Test cricket grounds, Lord's (home of Middlesex C.C.C.) in St John's Wood and the Oval (home of Surrey C.C.C.) in Kennington. Lord's has hosted four finals of the Cricket World Cup and is known as the Home of Cricket. Other key events are the annual mass-participation London Marathon, in which some 35,000 runners attempt a 26.2-mile (42.2 km) course around the city, and the University Boat Race on the Thames from Putney to Mortlake.\n\n\n== Notable people ==\n\n\n== See also ==\nOutline of England\nOutline of London\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Bibliography ===\nAckroyd, Peter (2001). London: The Biography. London: Vintage. p. 880. ISBN 978-0-09-942258-7.\nMills, David (2001). Dictionary of London Place Names. Oxford Paperbacks. ISBN 978-0-19-280106-7. OCLC 45406491.\n\n\n== External links ==\nLondon.gov.uk – Greater","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["165",{"pageContent":"London Authority\nVisitLondon.com – official tourism site\nMuseum of London\nMuirhead, James Fullarton (1922). \"London\" . Encyclopædia Britannica. Vol. 31 (12th ed.).\nLondon in British History Online, with links to numerous authoritative online sources\n\"London\", In Our Time, BBC Radio 4 discussion with Peter Ackroyd, Claire Tomalin and Iain Sinclair (28 September 2000)\n Geographic data related to London at OpenStreetMap\nOld maps of London, from the Eran Laor Cartographic Collection, National Library of Israel","metadata":{"source":"https://en.wikipedia.org/wiki/London"}}],["166",{"pageContent":"Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation.Python is dynamically typed and garbage-collected. It supports multiple programming paradigms, including structured (particularly procedural), object-oriented and functional programming. It is often described as a \"batteries included\" language due to its comprehensive standard library.Guido van Rossum began working on Python in the late 1980s as a successor to the ABC programming language and first released it in 1991 as Python 0.9.0. Python 2.0 was released in 2000. Python 3.0, released in 2008, was a major revision not completely backward-compatible with earlier versions. Python 2.7.18, released in 2020, was the last release of Python 2.Python consistently ranks as one of the most popular programming languages.\n\n\n== History ==\n\nPython was conceived in the late 1980s by Guido van Rossum at Centrum Wiskunde & Informatica (CWI) in the Netherlands as a successor to the ABC programming language, which was inspired by SETL, capable of exception handling and interfacing with the Amoeba operating system. Its implementation began in","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["167",{"pageContent":"December 1989. Van Rossum shouldered sole responsibility for the project, as the lead developer, until 12 July 2018, when he announced his \"permanent vacation\" from his responsibilities as Python's \"benevolent dictator for life\", a title the Python community bestowed upon him to reflect his long-term commitment as the project's chief decision-maker. In January 2019, active Python core developers elected a five-member Steering Council to lead the project.Python 2.0 was released on 16 October 2000, with many major new features such as list comprehensions, cycle-detecting garbage collection, reference counting, and Unicode support. Python 3.0, released on 3 December 2008, with many of its major features backported to Python 2.6.x and 2.7.x. Releases of Python 3 include the 2to3 utility, which automates the translation of Python 2 code to Python 3.Python 2.7's end-of-life was initially set for 2015, then postponed to 2020 out of concern that a large body of existing code could not easily be forward-ported to Python 3.  No further security patches or other improvements will be released for it. Currently only 3.7 and later are supported. In 2021, Python 3.9.2 and 3.8.8 were expedited as all","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["168",{"pageContent":"versions of Python (including 2.7) had security issues leading to possible remote code execution and web cache poisoning.In 2022, Python 3.10.4 and 3.9.12 were expedited and 3.8.13, and 3.7.13, because of many security issues. When Python 3.9.13 was released in May 2022, it was announced that the 3.9 series (joining the older series 3.8 and 3.7) would only receive security fixes in the future. On September 7, 2022, four new releases were made due to a potential denial-of-service attack: 3.10.7, 3.9.14, 3.8.14, and 3.7.14.As of November 2022, Python 3.11.0 is the current stable release. Notable changes from 3.10 include increased program execution speed and improved error reporting.\n\n\n== Design philosophy and features ==\nPython is a multi-paradigm programming language. Object-oriented programming and structured programming are fully supported, and many of their features support functional programming and aspect-oriented programming (including metaprogramming and metaobjects). Many other paradigms are supported via extensions, including design by contract and logic programming.Python uses dynamic typing and a combination of reference counting and a cycle-detecting garbage","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["169",{"pageContent":"collector for memory management. It uses dynamic name resolution (late binding), which binds method and variable names during program execution.\nIts design offers some support for functional programming in the Lisp tradition. It has filter,mapandreduce functions; list comprehensions, dictionaries, sets, and generator expressions. The standard library has two modules (itertools and functools) that implement functional tools borrowed from Haskell and Standard ML.Its core philosophy is summarized in the document The Zen of Python (PEP 20), which includes aphorisms such as:\nBeautiful is better than ugly.\nExplicit is better than implicit.\nSimple is better than complex.\nComplex is better than complicated.\nReadability counts.Rather than building all of its functionality into its core, Python was designed to be highly extensible via modules. This compact modularity has made it particularly popular as a means of adding programmable interfaces to existing applications. Van Rossum's vision of a small core language with a large standard library and easily extensible interpreter stemmed from his frustrations with ABC, which espoused the opposite approach.Python strives for a","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["170",{"pageContent":"simpler, less-cluttered syntax and grammar while giving developers a choice in their coding methodology. In contrast to Perl's \"there is more than one way to do it\" motto, Python embraces a \"there should be one—and preferably only one—obvious way to do it\"  philosophy. Alex Martelli, a Fellow at the Python Software Foundation and Python book author, wrote: \"To describe something as 'clever' is not considered a compliment in the Python culture.\"Python's developers strive to avoid premature optimization and reject patches to non-critical parts of the CPython reference implementation that would offer marginal increases in speed at the cost of clarity. When speed is important, a Python programmer can move time-critical functions to extension modules written in languages such as C; or use PyPy, a just-in-time compiler. Cython is also available, which translates a Python script into C and makes direct C-level API calls into the Python interpreter.\nPython's developers aim for it to be fun to use. This is reflected in its name—a tribute to the British comedy group Monty Python—and in occasionally playful approaches to tutorials and reference materials, such as the use of the terms \"spam\" and \"eggs\" (a","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["171",{"pageContent":"reference to a Monty Python sketch) in examples, instead of the often-used \"foo\" and \"bar\".A common neologism in the Python community is pythonic, which has a wide range of meanings related to program style. \"Pythonic\" code may use Python idioms well, be natural or show fluency in the language, or conform with Python's minimalist philosophy and emphasis on readability. Code that is difficult to understand or reads like a rough transcription from another programming language is called unpythonic.\n\n\n== Syntax and semantics ==\n\nPython is meant to be an easily readable language. Its formatting is visually uncluttered and often uses English keywords where other languages use punctuation. Unlike many other languages, it does not use curly brackets to delimit blocks, and semicolons after statements are allowed but rarely used. It has fewer syntactic exceptions and special cases than C or Pascal.\n\n\n=== Indentation ===\n\nPython uses whitespace indentation, rather than curly brackets or keywords, to delimit blocks. An increase in indentation comes after certain statements; a decrease in indentation signifies the end of the current block. Thus, the program's visual structure accurately","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["172",{"pageContent":"represents its semantic structure. This feature is sometimes termed the off-side rule. Some other languages use indentation this way; but in most, indentation has no semantic meaning. The recommended indent size is four spaces.\n\n\n=== Statements and control flow ===\nPython's statements include:\n\nThe assignment statement, using a single equals sign =\nThe if statement, which conditionally executes a block of code, along with else and elif (a contraction of else-if)\nThe for statement, which iterates over an iterable object, capturing each element to a local variable for use by the attached block\nThe while statement, which executes a block of code as long as its condition is true\nThe try statement, which allows exceptions raised in its attached code block to be caught and handled by except clauses (or new syntax except* in Python 3.11 for exception groups); it also ensures that clean-up code in a finally block is always run regardless of how the block exits\nThe raise statement, used to raise a specified exception or re-raise a caught exception\nThe class statement, which executes a block of code and attaches its local namespace to a class, for use in object-oriented programming\nThe def statement,","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["173",{"pageContent":"which defines a function or method\nThe with statement, which encloses a code block within a context manager (for example, acquiring a lock before it is run, then releasing the lock; or opening and closing a file), allowing resource-acquisition-is-initialization (RAII)-like behavior and replacing a common try/finally idiom\nThe break statement, which exits a loop\nThe continue statement, which skips the rest of the current iteration and continues with the next\nThe del statement, which removes a variable—deleting the reference from the name to the value, and producing an error if the variable is referred to before it is redefined\nThe pass statement, serving as a NOP, syntactically needed to create an empty code block\nThe assert statement, used in debugging to check for conditions that should apply\nThe yield statement, which returns a value from a generator function (and also an operator); used to implement coroutines\nThe return statement, used to return a value from a function\nThe import and from statements, used to import modules whose functions or variables can be used in the current programThe assignment statement (=) binds a name as a reference to a separate, dynamically allocated","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["174",{"pageContent":"object. Variables may subsequently be rebound at any time to any object. In Python, a variable name is a generic reference holder without a fixed data type; however, it always refers to some object with a type. This is called dynamic typing—in contrast to statically-typed languages, where each variable may contain only a value of a certain type.\nPython does not support tail call optimization or first-class continuations, and, according to Van Rossum, it never will. However, better support for coroutine-like functionality is provided by extending Python's generators. Before 2.5, generators were lazy iterators; data was passed unidirectionally out of the generator. From Python 2.5 on, it is possible to pass data back into a generator function; and from version 3.3, it can be passed through multiple stack levels.\n\n\n=== Expressions ===\nPython's expressions include:\n\nThe +, -, and * operators for mathematical addition, subtraction, and multiplication are similar to other languages, but the behavior of division differs. There are two types of divisions in Python: floor division (or integer division) // and floating-point/division. Python uses the ** operator for exponentiation.\nPython","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["175",{"pageContent":"uses the + operator for string concatenation. Python uses the * operator for duplicating a string a specified number of times.\nThe @ infix operator. It is intended to be used by libraries such as NumPy for matrix multiplication.\nThe syntax :=, called the \"walrus operator\", was introduced in Python 3.8. It assigns values to variables as part of a larger expression.\nIn Python, == compares by value. Python's is operator may be used to compare object identities (comparison by reference), and comparisons may be chained—for example, a <= b <= c.\nPython uses and, or, and not as boolean operators.\nPython has a type of expression called a list comprehension, as well as a more general expression called a generator expression.\nAnonymous functions are implemented using lambda expressions; however, there may be only one expression in each body.\nConditional expressions are written as x if c else y (different in order of operands from the c ? x : y operator common to many other languages).\nPython makes a distinction between lists and tuples. Lists are written as [1, 2, 3], are mutable, and cannot be used as the keys of dictionaries (dictionary keys must be immutable in Python). Tuples, written as (1, 2, 3), are","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["176",{"pageContent":"immutable and thus can be used as keys of dictionaries, provided all of the tuple's elements are immutable. The + operator can be used to concatenate two tuples, which does not directly modify their contents, but produces a new tuple containing the elements of both. Thus, given the variable t initially equal to (1, 2, 3), executing t = t + (4, 5) first evaluates t + (4, 5), which yields (1, 2, 3, 4, 5), which is then assigned back to t—thereby effectively \"modifying the contents\" of t while conforming to the immutable nature of tuple objects. Parentheses are optional for tuples in unambiguous contexts.\nPython features sequence unpacking where multiple expressions, each evaluating to anything that can be assigned (to a variable, writable property, etc.) are associated in an identical manner to that forming tuple literals—and, as a whole, are put on the left-hand side of the equal sign in an assignment statement. The statement expects an iterable object on the right-hand side of the equal sign that produces the same number of values as the provided writable expressions; when iterated through them, it assigns each of the produced values to the corresponding expression on the left.\nPython has a \"string","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["177",{"pageContent":"format\" operator % that functions analogously to printf format strings in C—e.g. \"spam=%s eggs=%d\" % (\"blah\", 2) evaluates to \"spam=blah eggs=2\". In Python 2.6+ and 3+, this was supplemented by the format() method of the str class, e.g. \"spam={0} eggs={1}\".format(\"blah\", 2). Python 3.6 added \"f-strings\": spam = \"blah\"; eggs = 2; f'spam={spam} eggs={eggs}'.\nStrings in Python can be concatenated by \"adding\" them (with the same operator as for adding integers and floats), e.g. \"spam\" + \"eggs\" returns \"spameggs\". If strings contain numbers, they are added as strings rather than integers, e.g. \"2\" + \"2\" returns \"22\".\nPython has various string literals:\nDelimited by single or double quote marks; unlike in Unix shells, Perl, and Perl-influenced languages, single and double quote marks work the same. Both use the backslash (\\) as an escape character. String interpolation became available in Python 3.6 as \"formatted string literals\".\nTriple-quoted (beginning and ending with three single or double quote marks), which may span multiple lines and function like here documents in shells, Perl, and Ruby.\nRaw string varieties, denoted by prefixing the string literal with r. Escape sequences are not","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["178",{"pageContent":"interpreted; hence raw strings are useful where literal backslashes are common, such as regular expressions and Windows-style paths. (Compare \"@-quoting\" in C#.)\nPython has array index and array slicing expressions in lists, denoted as a[key], a[start:stop] or a[start:stop:step]. Indexes are zero-based, and negative indexes are relative to the end. Slices take elements from the start index up to, but not including, the stop index. The third slice parameter called step or stride, allows elements to be skipped and reversed. Slice indexes may be omitted—for example, a[:] returns a copy of the entire list. Each element of a slice is a shallow copy.In Python, a distinction between expressions and statements is rigidly enforced, in contrast to languages such as Common Lisp, Scheme, or Ruby. This leads to duplicating some functionality. For example:\n\nList comprehensions vs. for-loops\nConditional expressions vs. if blocks\nThe eval() vs. exec() built-in functions (in Python 2, exec is a statement); the former is for expressions, the latter is for statementsStatements cannot be a part of an expression—so list and other comprehensions or lambda expressions, all being expressions, cannot","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["179",{"pageContent":"contain statements. A particular case is that an assignment statement such as a = 1 cannot form part of the conditional expression of a conditional statement. This has the advantage of avoiding a classic C error of mistaking an assignment operator = for an equality operator == in conditions: if (c = 1) { ... } is syntactically valid (but probably unintended) C code, but if c = 1: ... causes a syntax error in Python.\n\n\n=== Methods ===\nMethods on objects are functions attached to the object's class; the syntax instance.method(argument) is, for normal methods and functions, syntactic sugar for Class.method(instance, argument). Python methods have an explicit self parameter to access instance data, in contrast to the implicit self (or this) in some other object-oriented programming languages (e.g., C++, Java, Objective-C, Ruby). Python also provides methods, often called dunder methods (due to their names beginning and ending with double-underscores), to allow user-defined classes to modify how they are handled by native operations including length, comparison, in arithmetic operations and type conversion.\n\n\n=== Typing ===\n\nPython uses duck typing and has typed objects but untyped variable","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["180",{"pageContent":"names. Type constraints are not checked at compile time; rather, operations on an object may fail, signifying that it is not of a suitable type. Despite being dynamically typed, Python is strongly typed, forbidding operations that are not well-defined (for example, adding a number to a string) rather than silently attempting to make sense of them.\nPython allows programmers to define their own types using classes, most often used for object-oriented programming. New instances of classes are constructed by calling the class (for example, SpamClass() or EggsClass()), and the classes are instances of the metaclass type (itself an instance of itself), allowing metaprogramming and reflection.\nBefore version 3.0, Python had two kinds of classes (both using the same syntax): old-style and new-style, current Python versions only support the semantics new style.\nPython supports gradual typing. Python's syntax allows specifying static types, but they are not checked in the default implementation, CPython. An experimental optional static type-checker, mypy, supports compile-time type checking.\n\n\n=== Arithmetic operations ===\nPython has the usual symbols for arithmetic operators (+, -,","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["181",{"pageContent":"*, /), the floor division operator // and the modulo operation % (where the remainder can be negative,  e.g. 4 % -3 == -2). It also has ** for exponentiation, e.g. 5**3 == 125 and 9**0.5 == 3.0, and a matrix‑multiplication operator @ . These operators work like in traditional math; with the same precedence rules, the operators infix (+ and - can also be unary to represent positive and negative numbers respectively).\nThe division between integers produces floating-point results. The behavior of division has changed significantly over time:\nCurrent Python (i.e. since 3.0) changed / to always be floating-point division, e.g. 5/2 == 2.5.\nThe floor division // operator was introduced. So 7//3 == 2, -7//3 == -3, 7.5//3 == 2.0 and -7.5//3 == -3.0. Adding from __future__ import division causes a module used in Python 2.7 to use Python 3.0 rules for division (see above).In Python terms, / is true division (or simply division), and // is floor division. / before version 3.0 is classic division.Rounding towards negative infinity, though different from most languages, adds consistency. For instance, it means that the equation (a + b)//b == a//b + 1 is always true. It also means that the equation b*(a//b) + a%b == a is","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["182",{"pageContent":"valid for both positive and negative values of a. However, maintaining the validity of this equation means that while the result of a%b is, as expected, in the half-open interval [0, b), where b is a positive integer, it has to lie in the interval (b, 0] when b is negative.Python provides a round function for rounding a float to the nearest integer. For tie-breaking, Python 3 uses round to even: round(1.5) and round(2.5) both produce 2. Versions before 3 used round-away-from-zero: round(0.5) is 1.0, round(-0.5) is −1.0.Python allows boolean expressions with multiple equality relations in a manner that is consistent with general use in mathematics. For example, the expression a < b < c tests whether a is less than b and b is less than c. C-derived languages interpret this expression differently: in C, the expression would first evaluate a < b, resulting in 0 or 1, and that result would then be compared with c.Python uses arbitrary-precision arithmetic for all integer operations. The Decimal type/class in the decimal module provides decimal floating-point numbers to a pre-defined arbitrary precision and several rounding modes. The Fraction class in the fractions module provides arbitrary precision for","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["183",{"pageContent":"rational numbers.Due to Python's extensive mathematics library, and the third-party library NumPy that further extends the native capabilities, it is frequently used as a scientific scripting language to aid in problems such as numerical data processing and manipulation.\n\n\n== Programming examples ==\nHello world program:\n\nProgram to calculate the factorial of a positive integer:\n\n\n== Libraries ==\nPython's large standard library provides tools suited to many tasks and is commonly cited as one of its greatest strengths. For Internet-facing applications, many standard formats and protocols such as MIME and HTTP are supported. It includes modules for creating graphical user interfaces, connecting to relational databases, generating pseudorandom numbers, arithmetic with arbitrary-precision decimals, manipulating regular expressions, and unit testing.\nSome parts of the standard library are covered by specifications—for example, the Web Server Gateway Interface (WSGI) implementation wsgiref follows PEP 333—but most are specified by their code, internal documentation, and test suites. However, because most of the standard library is cross-platform Python code, only a few","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["184",{"pageContent":"modules need altering or rewriting for variant implementations.\nAs of 14 November 2022, the Python Package Index (PyPI), the official repository for third-party Python software, contains over 415,000 packages with a wide range of functionality, including:\n\n\n== Development environments ==\n\nMost Python implementations (including CPython) include a read–eval–print loop (REPL), permitting them to function as a command line interpreter for which users enter statements sequentially and receive results immediately.\nPython also comes with an Integrated development environment (IDE) called IDLE, which is more beginner-oriented.\nOther shells, including IDLE and IPython, add further abilities such as improved auto-completion, session state retention, and syntax highlighting.\nAs well as standard desktop integrated development environments, there are Web browser-based IDEs, including SageMath, for developing science- and math-related programs; PythonAnywhere, a browser-based IDE and hosting environment; and Canopy IDE, a commercial IDE emphasizing scientific computing.\n\n\n== Implementations ==\n\n\n=== Reference implementation ===\nCPython is the reference","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["185",{"pageContent":"implementation of Python. It is written in C, meeting the C89 standard (Python 3.11 uses C11) with several select C99 features. CPython includes its own C extensions, but third-party extensions are not limited to older C versions—e.g. they can be implemented with C11 or C++.) It compiles Python programs into an intermediate bytecode which is then executed by its virtual machine. CPython is distributed with a large standard library written in a mixture of C and native Python, and is available for many platforms, including Windows (starting with Python 3.9, the Python installer deliberately fails to install on Windows 7 and 8; Windows XP was supported until Python 3.5) and most modern Unix-like systems, including macOS (and Apple M1 Macs, since Python 3.9.1, with experimental installer) and unofficial support for e.g. VMS. Platform portability was one of its earliest priorities. (During Python 1 and 2 development, even OS/2 and Solaris were supported, but support has since been dropped for many platforms.)\n\n\n=== Other implementations ===\nPyPy is a fast, compliant interpreter of Python 2.7 and 3.8. Its just-in-time compiler often brings a significant speed improvement over CPython but some","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["186",{"pageContent":"libraries written in C cannot be used with it.\nStackless Python is a significant fork of CPython that implements microthreads; it does not use the call stack in the same way, thus allowing massively concurrent programs. PyPy also has a stackless version.\nMicroPython and CircuitPython are Python 3 variants optimized for microcontrollers, including Lego Mindstorms EV3.\nPyston is a variant of the Python runtime that uses just-in-time compilation to speed up the execution of Python programs.\nCinder is a performance-oriented fork of CPython 3.8 that contains a number of optimizations including bytecode inline caching, eager evaluation of coroutines, a method-at-a-time JIT, and an experimental bytecode compiler.\n\n\n=== Unsupported implementations ===\nOther just-in-time Python compilers have been developed, but are now unsupported:\n\nGoogle began a project named Unladen Swallow in 2009, with the aim of speeding up the Python interpreter fivefold by using the LLVM, and of improving its multithreading ability to scale to thousands of cores, while ordinary implementations suffer from the global interpreter lock.\nPsyco is a discontinued just-in-time specializing compiler that","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["187",{"pageContent":"integrates with CPython and transforms bytecode to machine code at runtime. The emitted code is specialized for certain data types and is faster than the standard Python code. Psyco does not support Python 2.7 or later.\nPyS60 was a Python 2 interpreter for Series 60 mobile phones released by Nokia in 2005. It implemented many of the modules from the standard library and some additional modules for integrating with the Symbian operating system. The Nokia N900 also supports Python with GTK widget libraries, enabling programs to be written and run on the target device.\n\n\n=== Cross-compilers to other languages ===\nThere are several compilers to high-level object languages, with either unrestricted Python, a restricted subset of Python, or a language similar to Python as the source language:\n\nBrython, Transcrypt and Pyjs (latest release in 2012) compile Python to JavaScript.\nCython compiles (a superset of) Python  to C (while the resulting code is also usable with Python and also e.g. C++).\nNuitka compiles Python into C.\nNumba uses LLVM to compile a subset of Python to machine code.\nPythran compiles a subset of Python 3 to C++ (C++11).\nRPython can be compiled to C, and is used to build the PyPy","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["188",{"pageContent":"interpreter of Python.\nThe Python → 11l → C++ transpiler compiles a subset of Python 3 to C++ (C++17).Specialized:\n\nMyHDL is a Python-based hardware description language (HDL), that converts MyHDL code to Verilog or VHDL code.Older projects (or not to be used with Python 3.x and latest syntax):\n\nGoogle's Grumpy (latest release in 2017) transpiles Python 2 to Go.\nIronPython  allows running Python 2.7 programs (and an alpha, released in 2021, is also available for \"Python 3.4, although features and behaviors from later versions may be included\") on the .NET Common Language Runtime.\nJython compiles Python 2.7 to Java bytecode, allowing the use of the Java libraries from a Python program.\nPyrex (latest release in 2010) and Shed Skin (latest release in 2013) compile to C and C++ respectively.\n\n\n=== Performance ===\nPerformance comparison of various Python implementations on a non-numerical (combinatorial) workload was presented at EuroSciPy '13. Python's performance compared to other programming languages is also benchmarked by The Computer Language Benchmarks Game.\n\n\n== Development ==\nPython's development is conducted largely through the Python Enhancement Proposal (PEP)","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["189",{"pageContent":"process, the primary mechanism for proposing major new features, collecting community input on issues, and documenting Python design decisions. Python coding style is covered in PEP 8. Outstanding PEPs are reviewed and commented on by the Python community and the steering council.Enhancement of the language corresponds with the development of the CPython reference implementation. The mailing list python-dev is the primary forum for the language's development. Specific issues were originally discussed in the Roundup bug tracker hosted at by the foundation. In 2022, all issues and discussions were migrated to GitHub. Development originally took place on a self-hosted source-code repository running Mercurial, until Python moved to GitHub in January 2017.CPython's public releases come in three types, distinguished by which part of the version number is incremented:\n\nBackward-incompatible versions, where code is expected to break and needs to be manually ported. The first part of the version number is incremented. These releases happen infrequently—version 3.0 was released 8 years after 2.0. According to Guido van Rossum, a version 4.0 is very unlikely to ever happen.\nMajor or","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["190",{"pageContent":"\"feature\" releases are largely compatible with the previous version but introduce new features. The second part of the version number is incremented. Starting with Python 3.9, these releases are expected to happen annually. Each major version is supported by bug fixes for several years after its release.\nBugfix releases, which introduce no new features, occur about every 3 months and are made when a sufficient number of bugs have been fixed upstream since the last release. Security vulnerabilities are also patched in these releases. The third and final part of the version number is incremented.Many alpha, beta, and release-candidates are also released as previews and for testing before final releases. Although there is a rough schedule for each release, they are often delayed if the code is not ready. Python's development team monitors the state of the code by running the large unit test suite during development.The major academic conference on Python is PyCon. There are also special Python mentoring programs, such as Pyladies.\nPython 3.10 deprecated wstr (to be removed in Python 3.12; meaning Python extensions need to be modified by then), and added pattern matching to the language.\n\n\n== API","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["191",{"pageContent":"documentation generators ==\nTools that can generate documentation for Python API include pydoc (available as part of the standard library), Sphinx, Pdoc and its forks, Doxygen and Graphviz, among others.\n\n\n== Naming ==\nPython's name is derived from the British comedy group Monty Python, whom Python creator Guido van Rossum enjoyed while developing the language. Monty Python references appear frequently in Python code and culture; for example, the metasyntactic variables often used in Python literature are spam and eggs instead of the traditional foo and bar. The official Python documentation also contains various references to Monty Python routines.The prefix Py- is used to show that something is related to Python. Examples of the use of this prefix in names of Python applications or libraries include Pygame, a binding of SDL to Python (commonly used to create games); PyQt and PyGTK, which bind Qt and GTK to Python respectively; and PyPy, a Python implementation originally written in Python.\n\n\n== Popularity ==\nSince 2003, Python has consistently ranked in the top ten most popular programming languages in the TIOBE Programming Community Index where as of December 2022 it was the most","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["192",{"pageContent":"popular language (ahead of C, C++, and Java). It was selected Programming Language of the Year (for \"the highest rise in ratings in a year\") in 2007, 2010, 2018, and 2020 (the only language to have done so four times as of 2020).\nAn empirical study found that scripting languages, such as Python, are more productive than conventional languages, such as C and Java, for programming problems involving string manipulation and search in a dictionary, and determined that memory consumption was often \"better than Java and not much worse than C or C++\".Large organizations that use Python include Wikipedia, Google, Yahoo!, CERN, NASA, Facebook, Amazon, Instagram, Spotify, and some smaller entities like ILM and ITA. The social news networking site Reddit was written mostly in Python.\n\n\n== Uses ==\n\nPython can serve as a scripting language for web applications, e.g., via mod_wsgi for the Apache webserver. With Web Server Gateway Interface, a standard API has evolved to facilitate these applications. Web frameworks like Django, Pylons, Pyramid, TurboGears, web2py, Tornado, Flask, Bottle, and Zope support developers in the design and maintenance of complex applications. Pyjs and IronPython can be used to","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["193",{"pageContent":"develop the client-side of Ajax-based applications. SQLAlchemy can be used as a data mapper to a relational database. Twisted is a framework to program communications between computers, and is used (for example) by Dropbox.\nLibraries such as NumPy, SciPy, and Matplotlib allow the effective use of Python in scientific computing, with specialized libraries such as Biopython and Astropy providing domain-specific functionality. SageMath is a computer algebra system with a notebook interface programmable in Python: its library covers many aspects of mathematics, including algebra, combinatorics, numerical mathematics, number theory, and calculus. OpenCV has Python bindings with a rich set of features for computer vision and image processing.Python is commonly used in artificial intelligence projects and machine learning projects with the help of libraries like TensorFlow, Keras, Pytorch, and scikit-learn. As a scripting language with a modular architecture, simple syntax, and rich text processing tools, Python is often used for natural language processing.Python can also be used to create games, with libraries such as Pygame, which can make 2D games.\nPython has been successfully","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["194",{"pageContent":"embedded in many software products as a scripting language, including in finite element method software such as Abaqus, 3D parametric modelers like FreeCAD, 3D animation packages such as 3ds Max, Blender, Cinema 4D, Lightwave, Houdini, Maya, modo, MotionBuilder, Softimage, the visual effects compositor Nuke, 2D imaging programs like GIMP, Inkscape, Scribus and Paint Shop Pro, and musical notation programs like scorewriter and capella. GNU Debugger uses Python as a pretty printer to show complex structures such as C++ containers. Esri promotes Python as the best choice for writing scripts in ArcGIS. It has also been used in several video games, and has been adopted as first of the three available programming languages in Google App Engine, the other two being Java and Go.Many operating systems include Python as a standard component. It ships with most Linux distributions, AmigaOS 4 (using Python 2.7), FreeBSD (as a package), NetBSD, and OpenBSD (as a package) and can be used from the command line (terminal). Many Linux distributions use installers written in Python: Ubuntu uses the Ubiquity installer, while Red Hat Linux and Fedora Linux use the Anaconda installer. Gentoo Linux uses Python in","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["195",{"pageContent":"its package management system, Portage.\nPython is used extensively in the information security industry, including in exploit development.Most of the Sugar software for the One Laptop per Child XO, developed at Sugar Labs since 2008, is written in Python. The Raspberry Pi single-board computer project has adopted Python as its main user-programming language.\nLibreOffice includes Python and intends to replace Java with Python. Its Python Scripting Provider is a core feature since Version 4.0 from 7 February 2013.\n\n\n== Languages influenced by Python ==\nPython's design and philosophy have influenced many other programming languages:\n\nBoo uses indentation, a similar syntax, and a similar object model.\nCobra uses indentation and a similar syntax, and its Acknowledgements document lists Python first among languages that influenced it.\nCoffeeScript, a programming language that cross-compiles to JavaScript, has Python-inspired syntax.\nECMAScript/JavaScript borrowed iterators and generators from Python.\nGDScript, a scripting language very similar to Python, built-in to the Godot game engine.\nGo is designed for the \"speed of working in a dynamic language like Python\" and","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["196",{"pageContent":"shares the same syntax for slicing arrays.\nGroovy was motivated by the desire to bring the Python design philosophy to Java.\nJulia was designed to be \"as usable for general programming as Python\".\nNim uses indentation and similar syntax.\nRuby's creator, Yukihiro Matsumoto, has said: \"I wanted a scripting language that was more powerful than Perl, and more object-oriented than Python. That's why I decided to design my own language.\"\nSwift, a programming language developed by Apple, has some Python-inspired syntax.Python's development practices have also been emulated by other languages. For example, the practice of requiring a document describing the rationale for, and issues surrounding, a change to the language (in Python, a PEP) is also used in Tcl, Erlang, and Swift.\n\n\n== See also ==\nPython syntax and semantics\npip (package manager)\nList of programming languages\nHistory of programming languages\nComparison of programming languages\n\n\n== References ==\n\n\n=== Sources ===\n\"Python for Artificial Intelligence\". Wiki.python.org. 19 July 2012. Archived from the original on 1 November 2012. Retrieved 3 December 2012.\nPaine, Jocelyn, ed. (August 2005). \"AI in Python\". AI Expert","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}],["197",{"pageContent":"Newsletter. Amzi!. Archived from the original on 26 March 2012. Retrieved 11 February 2012.\n\"PyAIML 0.8.5 : Python Package Index\". Pypi.python.org. Retrieved 17 July 2013.\nRussell, Stuart J. & Norvig, Peter (2009). Artificial Intelligence: A Modern Approach (3rd ed.). Upper Saddle River, NJ: Prentice Hall. ISBN 978-0-13-604259-4.\n\n\n== Further reading ==\nDowney, Allen B. (May 2012). Think Python: How to Think Like a Computer Scientist (version 1.6.6 ed.). ISBN 978-0-521-72596-5.\nHamilton, Naomi (5 August 2008). \"The A-Z of Programming Languages: Python\". Computerworld. Archived from the original on 29 December 2008. Retrieved 31 March 2010.\nLutz, Mark (2013). Learning Python (5th ed.). O'Reilly Media. ISBN 978-0-596-15806-4.\nSummerfield, Mark (2009). Programming in Python 3 (2nd ed.). Addison-Wesley Professional. ISBN 978-0-321-68056-3.\nRamalho, Luciano (May 2022). Fluent Python (2nd ed.). O'Reilly Media. ISBN 978-1-4920-5632-4.\n\n\n== External links ==\n\nOfficial website","metadata":{"source":"https://en.wikipedia.org/wiki/Python_(programming_language)"}}]]